Repository: rasult22/qazhylyq-app
Catalog: src/l10n/*.po
Languages: ru_ru, tt_kz

source: Қажылық және ұмра дұғалары
ru_ru: Дуа для Хаджа и Умры
tt_kz: قاجىلىق جانە ۇمرا دۇعالارى

source: Тіл ауыстыру
ru_ru: Сменить язык
tt_kz: ءتىل اۋىستىرۋ

source: Арафатқа барғанда оқылатын дұға
ru_ru: Дуа при поднятии на Арафат
tt_kz: ارافاتقا بارعاندا وقىلاتىن دۇعا

source: Арафат дұғасы
ru_ru: Дуа во время стояния на Арафате
tt_kz: ارافات دۇعاسى

source: Арафаттан Мұздалифаға барар кезде оқылатын дұға
ru_ru: Дуа по пути от Арафата к Муздалифе
tt_kz: ارافاتتان مۇزداليفاعا بارار كەزدە وقىلاتىن دۇعا

source: тәлбия
ru_ru: Тальбия
tt_kz: ءتالبيا

source: САПАРҒА ШЫҒАРДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа, читаемая при поездке
tt_kz: ساپارعا شىعاردا وقىلاتىن دۇعا

source: Мекке Мүкәррама дұғалары
ru_ru: Дуа читаемые в Мекке мукаррама
tt_kz: مەككە مۇكارراما دۇعالارى

source: Минада оқылатын дұғалар
ru_ru: Дуа читаемые в Мине
tt_kz: مينادا وقىلاتىن دۇعالار

source: арафат дұғалары
ru_ru: Дуа Арафат
tt_kz: ارافات دۇعالارى

source: Мұздалифа уақфасында оқылатын дұға
ru_ru: Дуа во время стояния на Муздалифе
tt_kz: مۇزداليفا ۋاقفاسىندا وقىلاتىن دۇعا

source: Шайтанға тас лақтырарда оқылатын дұға
ru_ru: Дуа при побивании шайтана камнями
tt_kz: شايتانعا تاس لاقتىراردا وقىلاتىن دۇعا

source: Құрбандық шаларда оқылатын дұға
ru_ru: Дуа во время жертвоприношения
tt_kz: قۇرباندىق شالاردا وقىلاتىن دۇعا

source: Шаш аларда оқылатын дұға
ru_ru: Дуа при обривании головы
tt_kz: شاش الاردا وقىلاتىن دۇعا

source: Мәдина мүнәууара дұғалары
ru_ru: Дуа которые читаются в Медине
tt_kz: ءمادينا ءمۇناۋۋارا دۇعالارى

source: Мәдина мүнәууараға кірерде оқылатын дұға
ru_ru: Дуа при входе в Медину
tt_kz: ءمادينا مۇناۋۋاراعا كىرەردە وقىلاتىن دۇعا

source: Пайғамбарымызға (с.а.у.) сәлем беру
ru_ru: Приветствие Пророку (с.а.в.)
tt_kz: پايعامبارىمىزعا (س.ا.ۋ.) سالەم بەرۋ

source: Бақи жұртына сәлем беру
ru_ru: Дуа на кладбище Баки
tt_kz: باقي جۇرتىنا سالەم بەرۋ

source: Ұхұд шейіттеріне сәлем беру
ru_ru: Приветствие павшим в битве при Ухуде
tt_kz: ۇحۇد شەيىتتەرىنە سالەم بەرۋ

source: Пайғамбарымызбен (с.а.у.) қоштасардағы дұға
ru_ru: Дуа при прощании с Пророком (с.а.в.)
tt_kz: پايعامبارىمىزبەن (س.ا.ۋ.) قوشتاسارداعى دۇعا

source: Мекке Мүкәррамаға кірерде оқылатын дұға
ru_ru: Дуа, читаемая при входе в Мекку мукаррама
tt_kz: مەككە مۇكارراماعا كىرەردە وقىلاتىن دۇعا

source: әл-Харамға кірерде оқылатын дұға
ru_ru: Дуа, читаемая при входе мечеть аль-Харам
tt_kz: ءال-حارامعا كىرەردە وقىلاتىن دۇعا

source: Қағба муаззаманы көргенде оқылатын дұға
ru_ru: Дуа читаемая при взгляде на Кааба муаззаму
tt_kz: قاعبا مۋاززامانى كورگەندە وقىلاتىن دۇعا

source: әл-Харамнан шығарда оқылатын дұға
ru_ru: Дуа читаемая при выходе из мечети аль-Харам
tt_kz: ءال-حارامنان شىعاردا وقىلاتىن دۇعا

source: Мүлтазамда оқылатын дұға
ru_ru: Дуа у Мультазама
tt_kz: ءمۇلتازامدا وقىلاتىن دۇعا

source: Хадиша анамызға сәлем беру
ru_ru: Приветствие Хадидже (р.анха)
tt_kz: حاديشا انامىزعا سالەم بەرۋ

source: Жәннәт ул-мұғаллаға сәлем беру
ru_ru: Приветствие Джаннат уль-муалля
tt_kz: ءجاننات ۋل-مۇعاللاعا سالەم بەرۋ

source: ҚАҒБА МУАЗЗАМАМЕН ҚОШТАСАРДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа при прощании с Каабой
tt_kz: قاعبا مۋاززامامەن قوشتاساردا وقىلاتىن دۇعا

source: Минаға жеткенде оқылатын дұға
ru_ru: Дуа по прибытии в Мину
tt_kz: ميناعا بارعاندا وقىلاتىن دۇعا

source: Минадан Арафатқа шығар кезде оқылатын дұға
ru_ru: Дуа по пути от Мины к Арафату
tt_kz: مينادان ارافاتقا بارا جاتقاندا وقىلاتىن دۇعا

source: Мұздалифадан кейін Минада оқылатын дұға
ru_ru: Дуа после Муздалифы в Мине
tt_kz: مۇزداليفادان كەيىن مينادا وقىلاتىن دۇعا

source: Жасыл шамдар
ru_ru: ЗЕЛЕНЫЕ ЛАМПЫ
tt_kz: جاسىل شامدار

source: Тауап намазынан кейін оқылатын дұға
ru_ru: Дуа после намаза-тауафа
tt_kz: تاۋاپ نامازىنان كەيىن وقىلاتىن دۇعا

source: Йемен бұрышы және Хажар ул-әсуад арасында оқылатын дұға
ru_ru: Дуа читаемая между Рукн Йемани и Рукн Хаджару’ль-Асвад
tt_kz: يەمەن بۇرىشى مەن ءحاجار ۋل-ءاسۋاد اراسىندا وقىلاتىن دۇعا

source: Шам бұрышы және Йемен бұрышы арасында оқылатын дұға
ru_ru: Дуа читаемая между Рукн Шами и Рукн Йемани
tt_kz: شام بۇرىشى مەن يەمەن بۇرىشى اراسىندا وقىلاتىن دۇعا

source: Ирак бұрышы мен Шам бұрышы арасында оқылатын дұға
ru_ru: Дуа читаемая между Рукн Ираки и Рукн Шами
tt_kz: يراك بۇرىشى مەن شام بۇرىشى اراسىندا وقىلاتىن دۇعا

source: Ибраһим мақамы тұсында оқылатын дұға
ru_ru: Дуа читаемая на уровне Макам Ибрахима
tt_kz: يبراھيم ماقامى تۇسىندا وقىلاتىن دۇعا

source: Мүлтәзамда оқылатын дұға
ru_ru: Дуа читаемая на уровне Мультазама
tt_kz: ءمۇلتازام تۇسىندا وقىلاتىن دۇعا

source: айналым
ru_ru: круг
tt_kz: اينالىم

source: Арафаттан Мұздалифаға барар жолда оқылатын дұға
ru_ru: Дуа по пути от Арафата к Муздалифе
tt_kz: ارافاتتان مۇزداليفاعا بارار جولدا وقىلاتىن دۇعا

source: ТАУАПҚА БАСТАУ ДҰҒАСЫ
ru_ru: Дуа перед началом тавафа
tt_kz: تاۋاپقا باستاۋ دۇعاسى

source: ТАУАП НАМАЗЫНАН СОҢ ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа после намаза-тауафа
tt_kz: تاۋاپ نامازىنان سوڭ وقىلاتىن دۇعا

source: Шам бұрышы мен Иемен бұрышы арасында оқылатын дұға
ru_ru: Дуа читаемая между Рукн Шами и Рукн Йемани
tt_kz: شام بۇرىشى مەن يەمەن بۇرىشى اراسىندا وقىلاتىن دۇعا

source: Иемен бұрышы мен Хәжар ул-әсуад арасында оқылатын дұға
ru_ru: Дуа читаемая между Рукн Йемани и Рукн Хаджару’ль-Асвад
tt_kz: يەمەن بۇرىشى مەن ءحاجار ۋل-ءاسۋاد اراسىندا وقىلاتىن دۇعا

source: 1-айналым
ru_ru: 1-й круг
tt_kz: 1-اينالىم

source: 2-айналым
ru_ru: 2-й круг
tt_kz: 2-اينالىم

source: 3-айналым
ru_ru: 3-й круг
tt_kz: 3-اينالىم

source: 4-айналым
ru_ru: 4-й круг
tt_kz: 4-اينالىم

source: 5-айналым
ru_ru: 5-й круг
tt_kz: 5-اينالىم

source: 6-айналым
ru_ru: 6-й круг
tt_kz: 6-اينالىم

source: 7-айналым
ru_ru: 7-й круг
tt_kz: 7-اينالىم

source: КӨЛІККЕ МІНЕРДЕ ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа, которая читается при посадке в транспорт
tt_kz: كولىككە مىنەردە وقىلاتىن دۇعا

source: Әбу Бәкірге (р.а.) сәлем беру
ru_ru: Приветствие Абу Бакра (р.а.)
tt_kz: ءابۋ باكىرگە (ر.ا.) سالەم بەرۋ

source: Омарға (р.а.) сәлем беру
ru_ru: Приветствие Умара (р.а.)
tt_kz: ومارعا (ر.ا.) سالەم بەرۋ

source: ӘЛ-ХАРАМҒА КІРЕРДЕ ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа, читаемая при входе мечеть аль-Харам
tt_kz: ءال-حارامعا كىرەردە وقىلاتىن دۇعا

source: Әл-Харамнан шығарда оқылатын дұға
ru_ru: Дуа читаемая при выходе из мечети аль-Харам
tt_kz: ءال-حارامنان شىعاردا وقىلاتىن دۇعا

source: Қағба муаззамамен қоштасарда оқылатын дұға
ru_ru: Дуа при прощании с Каабой
tt_kz: قاعبا مۋاززامامەن قوشتاساردا وقىلاتىن دۇعا

source: МЕККЕ МҮКӘРРАМАҒА КІРЕРДЕ ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа, читаемая при входе в Мекку мукаррама
tt_kz: مەككە مۇكارراماعا كىرەردە وقىلاتىن دۇعا

source: Минаға барғанда оқылатын дұға
ru_ru: Дуа по прибытии в Мину
tt_kz: ميناعا بارعاندا وقىلاتىن دۇعا

source: Минадан Арафатқа бара жатқанда оқылатын дұға
ru_ru: Дуа по пути от Мины к Арафату
tt_kz: مينادان ارافاتقا بارا جاتقاندا وقىلاتىن دۇعا

source: ЖАСЫЛ ШАМДАР БОЙЫМЕН ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа читаемая по зелеными лампами
tt_kz: جاسىل شامدار بويىمەن وقىلاتىن دۇعا

source: САФА МЕН МӘРУАҒА ӘР ШЫҚҚАНДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа при каждом подъеме на Сафа и Маву
tt_kz: سافا مەن مارۋاعا ءار شىققاندا وقىلاتىن دۇعا

source: САҒИДЫҢ БІРІНШІ АЙНАЛЫМЫНДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа для первого шавта Са‘я
tt_kz: ساعيدىڭ ءبىرىنشى اينالىمىندا وقىلاتىن دۇعا

source: САҒИДЫҢ ЕКІНШІ АЙНАЛЫМЫНДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа для второго шавта Са‘я
tt_kz: ساعيدىڭ ەكىنشى اينالىمىندا وقىلاتىن دۇعا

source: САҒИДЫҢ ҮШІНШІ АЙНАЛЫМЫНДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа для третьего шавта Са‘я
tt_kz: ساعيدىڭ ءۇشىنشى اينالىمىندا وقىلاتىن دۇعا

source: САҒИДЫҢ ТӨРТІНШІ АЙНАЛЫМЫНДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа для четвертого шавта Са‘я
tt_kz: ساعيدىڭ ءتورتىنشى اينالىمىندا وقىلاتىن دۇعا

source: САҒИДЫҢ БЕСІНШІ АЙНАЛЫМЫНДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа для пятого шавта Са‘я
tt_kz: ساعيدىڭ بەسىنشى اينالىمىندا وقىلاتىن دۇعا

source: САҒИДЫҢ АЛТЫНШЫ АЙНАЛЫМЫНДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа для шестого шавта Са‘я
tt_kz: ساعيدىڭ التىنشى اينالىمىندا وقىلاتىن دۇعا

source: САҒИДЫҢ ЖЕТІНШІ АЙНАЛЫМЫНДА ОҚЫЛАТЫН ДҰҒА
ru_ru: Дуа для седьмого шавта Са‘я
tt_kz: ساعيدىڭ جەتىنشى اينالىمىندا وقىلاتىن دۇعا

source: Тауапқа бастау дұғасы
ru_ru: Дуа перед началом тауафа
tt_kz: تاۋاپقا باستاۋ دۇعاسى

source: Османға (р.а.) сәлем беру
ru_ru: Приветствие Усмана (р.а.)
tt_kz: وسمانعا (ر.ا.) سالەم بەرۋ

source: БАРУ
ru_ru: Туда
tt_kz: بارۋ

source: ҚАЙТУ
ru_ru: Обратно
tt_kz: قايتۋ

source: Тауапқа бастамас бұрын, Хажар ул-әсуад тұсында жүрекпен: «Уа, Алла! Сені әлмисақтан қабылдадым. Дүниеге келіп, Сенің мейіріміңмен Сені тағы қабылдадым. Ал, енді мейірімің мен жомарттығыңның арқасында Сенің үйіңе келдім. Хажар ул-әсуадтың ішінде сақталған уәдем мен жүрегімдегі уәдемді салыстырып, уәдемді жаңартуға келдім. Бисмилләһи, Аллаһу әкбар!» деп сәлем береді. Сонан соң тауапқа бастау дұғасын оқиды.
ru_ru: Прежде чем отправится в таваф, с сердцем приветствует Хаджар уль-Асуад: «О. Аллах! Принял тебя с давних пор. Родившись, снова принял Тебя по милости твоей, Тебя с твоей добротой. Теперь, благодаря твоей доброте и щедрости пришел к Тебе. Внутри Хаджара уль-Асуада сдержанное обещание и обещание в моем сердце. Я пришел, чтобы сравнить и возобновить свое обещание. Бисмиллах, Аллаху Акбар!». Затем читает молитву перед началом тавафа.
tt_kz: تاۋاپقا باستاماس بۇرىن، حاجار ۋل-ءاسۋاد تۇسىندا جۇرەكپەن: «ۋا، اللا! سەنى الميساقتان قابىلدادىم. دۇنيەگە كەلىپ، سەنىڭ مەيىرىمىڭمەن سەنى تاعى قابىلدادىم. ال، ەندى مەيىرىمىڭ مەن جومارتتىعىڭنىڭ ارقاسىندا سەنىڭ ۇيىڭە كەلدىم. حاجار ۋل-ءاسۋادتىڭ ىشىندە ساقتالعان ۋادەم مەن جۇرەگىمدەگى ۋادەمدى سالىستىرىپ، ۋادەمدى جاڭارتۋعا كەلدىم. ءبيسميللاھي، اللاھۋ اكبار!» دەپ سالەم بەرەدى. سونان سوڭ تاۋاپقا باستاۋ دۇعاسىن وقيدى.

source: ТӘЛБИЯ
ru_ru: Тальбия
tt_kz: ءتالبيا

source: Сафа
tt_kz: سافا

source: Мәруа
ru_ru: Маруа
tt_kz: مارۋاعا
