import tavaf_begin_audio from '../../assets/tavaf_begin.mp3'
import tavaf_end_audio from '../../assets/tavaf_end.mp3'
import sham_and_yemen_audio from '../../assets/sham_and_yemen.mp3'
import yemen_and_hajar_audio from '../../assets/yemen_and_hajar.mp3'
import iraq_and_sham_audio from '../../assets/iraq_and_sham.mp3'
import ibrahim_audio from '../../assets/ibrahim.mp3'
import multazam_audio from '../../assets/multazam.mp3'
export const tavaf_begin = {
  audio_url: tavaf_begin_audio,
  title: 'ТАУАПҚА БАСТАУ ДҰҒАСЫ',
  title_ru: 'ДУА ПЕРЕД НАЧАЛОМ ТАВАФА',
  title_tt: `تاۋاپقا باستاۋ دۇعاسى`,
  prayer_text: `اَللّٰهُمَّ اِيمَانًا بِكَ وَتَصدِيقًا بِكِتابِكَ وَوَفاءً بِعَهْدِكَ وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ وَحَبِيبِكَ مُحَمَّدٍ صَلَى اَللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ.`,
  translation_text:
    'Уа, Алла! Өзіңе иман келтіріп, кітабыңды растап, Саған берген уәдемізді орындау үшін әрі сүйікті пайғамбарың Мұхаммедтің (с.а.у.) сүннетіне мойынсұнып құзырыңа келіп отырмын. Алланың игілігі мен сәлемі Пайғамбарымыз Мұхаммедке (с.а.у.) болсын.',
  translation_text_ru: `О, Аллах! Чтобы потвердить и выполнить обещание, данное Тебе и Пророку Мухаммеду (с.а.у.) подчиняясь Сунне, пришел к твоему попечительству. Да пребудет благославление и приветствие Аллаха с Пророком Мухаммед (с.а.у.).`,
  translation_text_tt:
    'ۋا، اللا! وزىڭە يمان كەلتىرىپ، كىتابىڭدى راستاپ، ساعان بەرگەن ۋادەمىزدى ورىنداۋ ءۇشىن ءارى سۇيىكتى پايعامبارىڭ مۇحاممەدتىڭ (س.ا.ۋ.) سۇننەتىنە مويىنسۇنىپ قۇزىرىڭا كەلىپ وتىرمىن. اللانىڭ يگىلىگى مەن سالەمى پايعامبارىمىز مۇحاممەدكە (س.ا.ۋ.) بولسىن.'
}
export const tavaf_end = {
  audio_url: tavaf_end_audio,
  title: 'ТАУАП НАМАЗЫНАН СОҢ ОҚЫЛАТЫН ДҰҒА',
  title_ru: 'ДУА ПОСЛЕ НАМАЗА-ТАВАФА',
  title_tt: `تاۋاپ نامازىنان سوڭ وقىلاتىن دۇعا`,
  prayer_text: `اَللّٰهُمَّ اِنَّكَ تَعْلَمُ سِرِّى وَعَلاَنِيَّتِى فَاقْبَلْ مَعْذِرَتِى وَتَعْلَمُ حَاجَتِى فَاعْطِنِى سُؤْلِى وَتَعْلَمُ مَا فِي نَفْسِى فَاغْفِرْلِى ذُنُوْبِى. اَللّٰهُمَّ اِنِّى اَسْاَلُكَ اِيْمَانًا دَائِمًا يُبَاشِرُ قَلْبِى وَيَقِيْنًا صَادِقًا حَتَّى اَعْلَمُ اَنَّهُ لاَ يُصِيبُنِى اِلَّا مَا كَتَبْتَ لِى رِضًا مِنْكَ بِمَا قَسَمْتَ لِى اَنْتَ وِلِيِّى فِي الدُّنْيَا وَاْلآخِرَةِ. تَوَفَّنِى مُسْلِمًا وَاَلْحِقْنِى بِالصَّالِحِينَ. اَللّٰهُمَّ لاَ تَدَعْ لَنَا فِى مَقَامِنَا هٰذَا ذَنْباً اِلَّا غَفَرْتَهُ وَلاَ هَمًّا اِلاَّ فَرَّجْتَهُ وَلاَ حَاجَةً اِلاَّ قَضَيْتَهَا وَيَسَّرْتَهَا فَيَسِّرْ اَمُورَنَا وَاشْرَحْ صُدُورَنَا وَنَوِّرْ قُلُوبَنَا وَاخْتِمْ بِالصَّالِحَاتِ اَعْمَالَنَا. اَللّٰهُمَّ تَوَفَّنَا مُسْلِمِينَ وَاَحْيِنَا مُسْلِمِينَ وَاَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلاَ مَفْتُونِينَ`,
  translation_text: `Уа, Алла! Сен менің ішімді де, сыртымды да білесің, кешірімімді қабыл алғайсың. Мұқтаждығымды білесің, сұрағанымды бергейсің. Қандай екенімді білесің, күнәларымды кешіргейсің.
Уа, Алла! Сенің жазғаныңнан басқаның басыма  келмейтініне иланатындай, Сенің бөліп бергеніңе разы болатындай жүрегімді басқаратын күшті, берік иман тілеймін. Дүние мен ақыретте менің Ием Сенсің. Уа, Раббым, мұсылман күйімде жанымды алып, мені салих құлдарыңың санатына қоса көр.
Уа, Раббым! Осы күйімізде бізден кешірілмеген күнә, шешілмеген түйін, өтелмеген қажеттілік қалдырмағайсың! Істерімізді оң қылып, көкірегімізді кең қылып, жүрегімізді нұрландыра көр. Амалдарымызды  оңынан аяқтата көр.
Уа, Алла! Бізді мұсылман күйімізде жанымызды алып, мұсылман қылып тірілт. Кемшіліксіз, күнәсіз тақуа құлдарыңның арасына қос.
`,
  translation_text_ru: `О Аллах! Несомненно, Тебе известно все обо мне. Прими мое покаяние. Ты знаешь, в чем я нуждаюсь, даруй мне то, о чем я прошу. Ты знаешь скрытое в моей душе. Прости же мои грехи.
О Аллах! Я прошу Тебя о крепкой и непоколебимой вере; чтобы я твердо верил, что со мной случится лишь то, что предопределено Тобой. Ты - мой Господь в этом мире и вечном. Господь мой, упокой меня мусульманином и введи в число праведных рабов.
Господь мой, не оставляй же нам ни одного греха, которого Ты не простил бы, ни одной тревоги, от которой Ты нас не избавил бы, и ни одного желания, которым Ты был бы доволен и не осуществил его. Облегчи наши дела, успокой наши души, освети наши сердца, сделай наши деяния благими.
Господь мой, упокой нас мусульманами, воскреси нас мусульманами, избавь от постыдного и греховногои введи нас в число Твоих праведных рабов.
`,
  translation_text_tt: `ۋا، اللا! سەن مەنىڭ ءىشىمدى دە، سىرتىمدى دا بىلەسىڭ، كەشىرىمىمدى قابىل العايسىڭ. مۇقتاجدىعىمدى بىلەسىڭ، سۇراعانىمدى بەرگەيسىڭ. قانداي ەكەنىمدى بىلەسىڭ، كۇنالارىمدى كەشىرگەيسىڭ.
ۋا، اللا! سەنىڭ جازعانىڭنان باسقانىڭ باسىما كەلمەيتىنىنە يلاناتىنداي، سەنىڭ ءبولىپ بەرگەنىڭە رازى بولاتىنداي جۇرەگىمدى باسقاراتىن كۇشتى، بەرىك يمان تىلەيمىن. دۇنيە مەن اقىرەتتە مەنىڭ يەم سەنسىڭ. ۋا، راببىم، مۇسىلمان كۇيىمدە جانىمدى الىپ، مەنى ساليح قۇلدارىڭىڭ ساناتىنا قوسا كور.
ۋا، راببىم! وسى كۇيىمىزدە بىزدەن كەشىرىلمەگەن كۇنا، شەشىلمەگەن ءتۇيىن، وتەلمەگەن قاجەتتىلىك قالدىرماعايسىڭ! ىستەرىمىزدى وڭ قىلىپ، كوكىرەگىمىزدى كەڭ قىلىپ، جۇرەگىمىزدى نۇرلاندىرا كور. امالدارىمىزدى وڭىنان اياقتاتا كور.
ۋا، اللا! ءبىزدى مۇسىلمان كۇيىمىزدە جانىمىزدى الىپ، مۇسىلمان قىلىپ ءتىرىلت. كەمشىلىكسىز، كۇناسىز تاقۋا قۇلدارىڭنىڭ اراسىنا قوس.`
}

// {
//      audio_url: tavaf_begin,
//     title: '1 - айналым',
//     title_ru: '1 - круг',
//     title_tt: ``,
//     prayer_text: ``,
//     translation_text: '',
//     translation_text_ru: ``,
//     translation_text_tt: ''
//   }
export const sham_and_yemen = {
  audio_url: sham_and_yemen_audio,
  title: 'Отсутсвует',
  title_ru: 'Отсутсвует',
  title_tt: `Отсутсвует`,
  prayer_text: `Отсутсвует`,
  translation_text: 'Отсутсвует',
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: 'Отсутсвует'
}
export const yemen_and_hajar = {
  audio_url: yemen_and_hajar_audio,
  title: 'Отсутсвует',
  title_ru: 'Отсутсвует',
  title_tt: `Отсутсвует`,
  prayer_text: `Отсутсвует`,
  translation_text: 'Отсутсвует',
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: 'Отсутсвует'
}
export const iraq_and_sham = {
  audio_url: iraq_and_sham_audio,
  title: 'Отсутсвует',
  title_ru: 'Отсутсвует',
  title_tt: `Отсутсвует`,
  prayer_text: `Отсутсвует`,
  translation_text: 'Отсутсвует',
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: 'Отсутсвует'
}
export const ibrahim = {
  audio_url: ibrahim_audio,
  title: 'Отсутсвует',
  title_ru: 'Отсутсвует',
  title_tt: `Отсутсвует`,
  prayer_text: `Отсутсвует`,
  translation_text: 'Отсутсвует',
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: 'Отсутсвует'
}

export const multazam = {
  audio_url: multazam_audio,
  title: 'Отсутсвует',
  title_ru: 'Отсутсвует',
  title_tt: `Отсутсвует`,
  prayer_text: `Отсутсвует`,
  translation_text: 'Отсутсвует',
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: 'Отсутсвует'
}
