import tavaf_begin_audio from '../../assets/tavaf_begin.mp3'
import tavaf_end_audio from '../../assets/tavaf_end.mp3'
import sham_and_yemen_audio from '../../assets/sham_and_yemen.mp3'
import yemen_and_hajar_audio from '../../assets/yemen_and_hajar.mp3'
import iraq_and_sham_audio from '../../assets/iraq_and_sham.mp3'
import ibrahim_audio from '../../assets/ibrahim.mp3'
import multazam_audio from '../../assets/multazam.mp3'
export const tavaf_begin = {
  audio_url: tavaf_begin_audio,
  title: 'ТАУАПҚА БАСТАУ ДҰҒАСЫ',
  title_ru: 'ДУА ПЕРЕД НАЧАЛОМ ТАВАФА',
  title_tt: `تاۋاپقا باستاۋ دۇعاسى`,
  prayer_text: `اَللّٰهُمَّ اِيمَانًا بِكَ وَتَصدِيقًا بِكِتابِكَ وَوَفاءً بِعَهْدِكَ وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ وَحَبِيبِكَ مُحَمَّدٍ صَلَى اَللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ.`,
  translation_text:
    'Уа, Алла! Өзіңе иман келтіріп, кітабыңды растап, Саған берген уәдемізді орындау үшін әрі сүйікті пайғамбарың Мұхаммедтің (с.а.у.) сүннетіне мойынсұнып құзырыңа келіп отырмын. Алланың игілігі мен сәлемі Пайғамбарымыз Мұхаммедке (с.а.у.) болсын.',
  translation_text_ru: `О, Аллах! Чтобы потвердить и выполнить обещание, данное Тебе и Пророку Мухаммеду (с.а.у.) подчиняясь Сунне, пришел к твоему попечительству. Да пребудет благославление и приветствие Аллаха с Пророком Мухаммед (с.а.у.).`,
  translation_text_tt:
    'ۋا، اللا! وزىڭە يمان كەلتىرىپ، كىتابىڭدى راستاپ، ساعان بەرگەن ۋادەمىزدى ورىنداۋ ءۇشىن ءارى سۇيىكتى پايعامبارىڭ مۇحاممەدتىڭ (س.ا.ۋ.) سۇننەتىنە مويىنسۇنىپ قۇزىرىڭا كەلىپ وتىرمىن. اللانىڭ يگىلىگى مەن سالەمى پايعامبارىمىز مۇحاممەدكە (س.ا.ۋ.) بولسىن.'
}
export const tavaf_end = {
  audio_url: tavaf_end_audio,
  title: 'ТАУАП НАМАЗЫНАН СОҢ ОҚЫЛАТЫН ДҰҒА',
  title_ru: 'ДУА ПОСЛЕ НАМАЗА-ТАВАФА',
  title_tt: `تاۋاپ نامازىنان سوڭ وقىلاتىن دۇعا`,
  prayer_text: `اَللّٰهُمَّ اِنَّكَ تَعْلَمُ سِرِّى وَعَلاَنِيَّتِى فَاقْبَلْ مَعْذِرَتِى وَتَعْلَمُ حَاجَتِى فَاعْطِنِى سُؤْلِى وَتَعْلَمُ مَا فِي نَفْسِى فَاغْفِرْلِى ذُنُوْبِى. اَللّٰهُمَّ اِنِّى اَسْاَلُكَ اِيْمَانًا دَائِمًا يُبَاشِرُ قَلْبِى وَيَقِيْنًا صَادِقًا حَتَّى اَعْلَمُ اَنَّهُ لاَ يُصِيبُنِى اِلَّا مَا كَتَبْتَ لِى رِضًا مِنْكَ بِمَا قَسَمْتَ لِى اَنْتَ وِلِيِّى فِي الدُّنْيَا وَاْلآخِرَةِ. تَوَفَّنِى مُسْلِمًا وَاَلْحِقْنِى بِالصَّالِحِينَ. اَللّٰهُمَّ لاَ تَدَعْ لَنَا فِى مَقَامِنَا هٰذَا ذَنْباً اِلَّا غَفَرْتَهُ وَلاَ هَمًّا اِلاَّ فَرَّجْتَهُ وَلاَ حَاجَةً اِلاَّ قَضَيْتَهَا وَيَسَّرْتَهَا فَيَسِّرْ اَمُورَنَا وَاشْرَحْ صُدُورَنَا وَنَوِّرْ قُلُوبَنَا وَاخْتِمْ بِالصَّالِحَاتِ اَعْمَالَنَا. اَللّٰهُمَّ تَوَفَّنَا مُسْلِمِينَ وَاَحْيِنَا مُسْلِمِينَ وَاَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلاَ مَفْتُونِينَ`,
  translation_text: `Уа, Алла! Сен менің ішімді де, сыртымды да білесің, кешірімімді қабыл алғайсың. Мұқтаждығымды білесің, сұрағанымды бергейсің. Қандай екенімді білесің, күнәларымды кешіргейсің.
Уа, Алла! Сенің жазғаныңнан басқаның басыма  келмейтініне иланатындай, Сенің бөліп бергеніңе разы болатындай жүрегімді басқаратын күшті, берік иман тілеймін. Дүние мен ақыретте менің Ием Сенсің. Уа, Раббым, мұсылман күйімде жанымды алып, мені салих құлдарыңың санатына қоса көр.
Уа, Раббым! Осы күйімізде бізден кешірілмеген күнә, шешілмеген түйін, өтелмеген қажеттілік қалдырмағайсың! Істерімізді оң қылып, көкірегімізді кең қылып, жүрегімізді нұрландыра көр. Амалдарымызды  оңынан аяқтата көр.
Уа, Алла! Бізді мұсылман күйімізде жанымызды алып, мұсылман қылып тірілт. Кемшіліксіз, күнәсіз тақуа құлдарыңның арасына қос.
`,
  translation_text_ru: `О Аллах! Несомненно, Тебе известно все обо мне. Прими мое покаяние. Ты знаешь, в чем я нуждаюсь, даруй мне то, о чем я прошу. Ты знаешь скрытое в моей душе. Прости же мои грехи.
О Аллах! Я прошу Тебя о крепкой и непоколебимой вере; чтобы я твердо верил, что со мной случится лишь то, что предопределено Тобой. Ты - мой Господь в этом мире и вечном. Господь мой, упокой меня мусульманином и введи в число праведных рабов.
Господь мой, не оставляй же нам ни одного греха, которого Ты не простил бы, ни одной тревоги, от которой Ты нас не избавил бы, и ни одного желания, которым Ты был бы доволен и не осуществил его. Облегчи наши дела, успокой наши души, освети наши сердца, сделай наши деяния благими.
Господь мой, упокой нас мусульманами, воскреси нас мусульманами, избавь от постыдного и греховногои введи нас в число Твоих праведных рабов.
`,
  translation_text_tt: `ۋا، اللا! سەن مەنىڭ ءىشىمدى دە، سىرتىمدى دا بىلەسىڭ، كەشىرىمىمدى قابىل العايسىڭ. مۇقتاجدىعىمدى بىلەسىڭ، سۇراعانىمدى بەرگەيسىڭ. قانداي ەكەنىمدى بىلەسىڭ، كۇنالارىمدى كەشىرگەيسىڭ.
ۋا، اللا! سەنىڭ جازعانىڭنان باسقانىڭ باسىما كەلمەيتىنىنە يلاناتىنداي، سەنىڭ ءبولىپ بەرگەنىڭە رازى بولاتىنداي جۇرەگىمدى باسقاراتىن كۇشتى، بەرىك يمان تىلەيمىن. دۇنيە مەن اقىرەتتە مەنىڭ يەم سەنسىڭ. ۋا، راببىم، مۇسىلمان كۇيىمدە جانىمدى الىپ، مەنى ساليح قۇلدارىڭىڭ ساناتىنا قوسا كور.
ۋا، راببىم! وسى كۇيىمىزدە بىزدەن كەشىرىلمەگەن كۇنا، شەشىلمەگەن ءتۇيىن، وتەلمەگەن قاجەتتىلىك قالدىرماعايسىڭ! ىستەرىمىزدى وڭ قىلىپ، كوكىرەگىمىزدى كەڭ قىلىپ، جۇرەگىمىزدى نۇرلاندىرا كور. امالدارىمىزدى وڭىنان اياقتاتا كور.
ۋا، اللا! ءبىزدى مۇسىلمان كۇيىمىزدە جانىمىزدى الىپ، مۇسىلمان قىلىپ ءتىرىلت. كەمشىلىكسىز، كۇناسىز تاقۋا قۇلدارىڭنىڭ اراسىنا قوس.`
}

// {
//      audio_url: tavaf_begin,
//     title: '1 - айналым',
//     title_ru: '1 - круг',
//     title_tt: ``,
//     prayer_text: ``,
//     translation_text: '',
//     translation_text_ru: ``,
//     translation_text_tt: ''
//   }
export const sham_and_yemen = {
  audio_url: sham_and_yemen_audio,
  title: 'Шам - Йемен',
  title_ru: 'Шам - Йемен',
  title_tt: `شام - يەمەن`,
  prayer_text: `لَا‭ ‬اِلٰهَ‭ ‬اِلَّا‭ ‬اللهُ‭ ‬وَحْدَهُ‭ ‬لاَ‭ ‬شَريكَ‭ ‬لَهُ‭ ‬لَهُ‭ ‬المُلْكُ‭ ‬وَلَهُ‭ ‬الحَمْدُ‭ ‬يُحْيِى‭ ‬وَيُمِيتُ‭ ‬وَهُوَ‭ ‬حَيٌّ‭ ‬لَايَمُوتُ‭ ‬بِيَدِهِ‭ ‬الْخَيْرُ‭ ‬وَهُوَ‭ ‬عَلَى‭ ‬كُلِّ‭ ‬شَىْءٍ‭ ‬قَدِيرٌ‭. ‬اَللّٰهُمَّ‭ ‬مُنْزِلَ‭ ‬الْكِتَابِ‭ ‬سَرِيعَ‭ ‬الْحِسَابِ‭ ‬اِهْزِمِ‭ ‬الْاَحْزَابَ‭ ‬اَللّٰهُمَّ‭ ‬اهْزِمْهُمْ‭ ‬وَانْصُرْنَا‭ ‬عَلَيْهِمْ‭ ‬وَزَلْزِلْهُمْ‭ ‬اَللّٰهُمَّ‭ ‬يَا‭ ‬مُجِيبَ‭ ‬الْمُضْطَرِّينَ‭ ‬وَيَا‭ ‬صَرِيخَ‭ ‬الْـمَكْرُوبِينَ‭ ‬اِكْشِفْ‭ ‬عَنَّا‭ ‬هَمَّنَا‭ ‬وَغَمَّنَا‭ ‬وكُرْبَتَنَا‭ ‬فَاِنَّكَ‭ ‬تَرَى‭ ‬مَا‭ ‬نَزَلَ‭ ‬بِنَا‭ ‬وَبِالْمُؤْمِنِينَ‭ ‬جَمِيعاً‭ ‬اَللّٰهُمَّ‭ ‬اسْتُرْ‭ ‬عَوْرَاتِنَا‭ ‬وَامِنْ‭ ‬رَوْعَاتِنَا‭ ‬يَا‭ ‬اَكْرَمَ‭ ‬الْاَكْرَمِينَ‭ ‬وَيَا‭ ‬اَرْحَمَ‭ ‬الرَّاحِمِينَ‭.`,
  translation_text: `Алладан өзге құдай жоқ. Ол - жалғыз, ортағы жоқ. Мүлік Оның қолында, мадақ та Оған арналады. Ол тірілтеді һәм өлтіреді. Ол тірі, ешқашан өлмейді. Жақсылық Оның қолында. Оның барлық нәрсеге күші жетеді.
Уа, Кітапты (Құран кәрімді) түсірген, есепті жылдам алатын Алла. Уа, Алла! Дұшпан әскерін күйрет. Оларды талқандап, бізге жәрдем ет, оларды сілкіле. Уа, қиындықта қалғанға жәрдем берген, мұңайғанның қайғысын сейілткен Алла. Бізді қайғы-мұңнан, қиындықтан құтқара көр. Сен біздің және барлық мұсылмандардың басына келгендерді көресің. Уа, Алла! Күнәмізді жасыр, қорқынышымызды сейілт. Уа, жомарттардың ең жомарты, мейірімділердің ең мейірімдісі.`,
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: `اللادان وزگە قۇداي جوق. ول - جالعىز، ورتاعى جوق. مۇلىك ونىڭ قولىندا، ماداق تا وعان ارنالادى. ول تىرىلتەدى ءھام ولتىرەدى. ول ءتىرى، ەشقاشان ولمەيدى. جاقسىلىق ونىڭ قولىندا. ونىڭ بارلىق نارسەگە كۇشى جەتەدى.
ۋا، كىتاپتى (قۇران كارىمدى) تۇسىرگەن، ەسەپتى جىلدام الاتىن اللا. ۋا، اللا! دۇشپان اسكەرىن كۇيرەت. ولاردى تالقانداپ، بىزگە جاردەم ەت، ولاردى سىلكىلە. ۋا، قيىندىقتا قالعانعا جاردەم بەرگەن، مۇڭايعاننىڭ قايعىسىن سەيىلتكەن اللا. ءبىزدى قايعى-مۇڭنان، قيىندىقتان قۇتقارا كور. سەن ءبىزدىڭ جانە بارلىق مۇسىلمانداردىڭ باسىنا كەلگەندەردى كورەسىڭ. ۋا، اللا! كۇنامىزدى جاسىر، قورقىنىشىمىزدى سەيىلت. ۋا، جومارتتاردىڭ ەڭ جومارتى، مەيىرىمدىلەردىڭ ەڭ مەيىرىمدىسى.`
}
export const yemen_and_hajar = {
  audio_url: yemen_and_hajar_audio,
  title: 'Йемен - Хажар ул-әсуад',
  title_ru: 'Йемен - Хаджару’ль-Асвад',
  title_tt: `يەمەن - حاجار ۋل-ءاسۋاد`,
  prayer_text: `رَبَّنَا‭ ‬آتِنَا‭ ‬فِى‭ ‬الدُّنْيَا‭ ‬حَسَنَةً‭ ‬وَفِي‭ ‬الْآخِرَةِ‭ ‬حَسَنَةً‭ ‬وَقِنَا‭ ‬عَذَابَ‭ ‬النَّار‭ ‬وَ‭ ‬اََدْخِلْنَا‭ ‬الْجَنَّةَ‭ ‬مَعَ‭ ‬الْاََبْرَارِ‭ ‬يَا‭ ‬عَزِيزُ‭ ‬يَا‭ ‬غَفَّارُ‭ ‬يَا‭ ‬رَبَّ‭ ‬الْعَالَمِينَ‭. ‬اَللّٰهُمَّ‭ ‬اِنِّى‭ ‬اَسْئَلُكَ‭ ‬الْعَفْوَ‭ ‬وَ‭ ‬الْعَافِيَةَ‭ ‬وَالْمُعَافَاةَ‭ ‬الدَّائِمَةَ‭ ‬فِي‭ ‬الدِّينِ‭ ‬وَالدُّنْيَا‭ ‬وَالْاَخِرَةِ‭ ‬وَالْفَوْزَ‭ ‬بِالْجَنَّةِ‭ ‬وَالنَّجَاةَ‭ ‬مِنَ‭ ‬النَّارِ‭ ‬يَا‭ ‬اَرْحَمَ‭ ‬الرَّاحِمِينَ‭. ‬وَ‭ ‬صَلَّى‭ ‬اللهُ‭ ‬عَلَى‭ ‬سَيِّدِنَا‭ ‬مُحَمَّدٍ‭ ‬وَ‭ ‬آلِهِ‭ ‬وَ‭ ‬صَحْبِهِ‭ ‬اَجْمَعِينَ‭.`,
  translation_text: `Уа, Раббым! Бізге дүниеде және ақыретте жақсылық бере көр. Бізді тозақ отынан сақта, тақуалармен бірге жәннатыңа кіргіз. Уа, Өте Үстем әрі Өте кешірімді бүкіл ғаламның Раббысы! 
Уа, Алла! Дініме, дүниеме және ақыретіме тиісті барлық істерімде Сенен кешірім, амандық тілеймін. Уа, мейірімділердің ең мейірімдісі! Мейіріміңмен жұмағыңа кіргізіп, тозағыңнан қашық қыла көр. Пайғамбарымыз Мұхаммедке (с.а.у.) және оның отбасы мен сахабаларына Алланың игілігі мен сәлемі болсын!`,
  translation_text_ru: `О, Аллах! Дай нам всего хорошего в этой и той жизни, защити нас от огня Ада. О, Господь! Очень властный и снисходительный всей Вселенной. 
О, Аллах! Во всем, что касается моей религий, моего мира и моей судьбы, я прошу прощения у Тебя, желаю благополучия. Впусти своей добротой милосердией в свой Рай, и держи в стороне от Ада. Да будет благославление Аллаха Пророку Мухаммеду (с.а.у) и его семье и всем сахабам.`,
  translation_text_tt: `ۋا، راببىم! بىزگە دۇنيەدە جانە اقىرەتتە جاقسىلىق بەرە كور. ءبىزدى توزاق وتىنان ساقتا، تاقۋالارمەن بىرگە ءجانناتىڭا كىرگىز. ۋا، وتە ۇستەم ءارى وتە كەشىرىمدى بۇكىل عالامنىڭ راببىسى! 
ۋا، اللا! دىنىمە، دۇنيەمە جانە اقىرەتىمە ءتيىستى بارلىق ىستەرىمدە سەنەن كەشىرىم، اماندىق تىلەيمىن. ۋا، مەيىرىمدىلەردىڭ ەڭ مەيىرىمدىسى! مەيىرىمىڭمەن جۇماعىڭا كىرگىزىپ، توزاعىڭنان قاشىق قىلا كور. پايعامبارىمىز مۇحاممەدكە (س.ا.ۋ.) جانە ونىڭ وتباسى مەن ساحابالارىنا اللانىڭ يگىلىگى مەن سالەمى بولسىن!`
}
export const iraq_and_sham = {
  audio_url: iraq_and_sham_audio,
  title: 'Ирак - Шам',
  title_ru: 'Ирак - Шам',
  title_tt: `يراك - شام`,
  prayer_text: `سُبْحَانَ‭ ‬اللهِ‭ ‬وَالْحَمْدُ‭ ‬للهِ‭ ‬وَلَا‭ ‬اِلَهَ‭ ‬اِلَّا‭ ‬اللهُ‭ ‬وَاللهُ‭ ‬اَكْبَرُ‭ ‬وَلَاحَوْلَ‭ ‬وَلَا‭ ‬قُوَّةَ‭ ‬اِلَّا‭ ‬بِاللهِ‭ ‬الْعَلِىِّ‭ ‬الْعَظِيمِ‭.`,
  translation_text: 'Алланы бүкіл кемшілік атаулыдан пәктеймін. Мадақ Оған тән. Алладан басқа құдай жоқ. Алла ұлы. Барлық күш пен құдірет шексіз құдырет иесі Аллаға тән.',
  translation_text_ru: `Аллах чист и безупречен от всех недостатков. Похвала ему присуща. Нет Бога кроме Аллаха. Аллах велик. Обладатель всей силы и всемогущества.`,
  translation_text_tt: `اللانى بۇكىل كەمشىلىك اتاۋلىدان پاكتەيمىن. ماداق وعان ءتان. اللادان باسقا قۇداي جوق. اللا ۇلى. بارلىق كۇش پەن قۇدىرەت شەكسىز قۇدىرەت يەسى اللاعا ءتان.`
}
export const ibrahim = {
  audio_url: ibrahim_audio,
  title: 'Ибраһим мақамы',
  title_ru: 'Макам Ибрахима',
  title_tt: `يبراھيم ماقامى`,
  prayer_text: `اَللّٰهُمَّ‭ ‬صَلِّ‭ ‬عَلَى‭ ‬مُحَمَّدٍ‮ ‬وَعَلَى‭ ‬آلِ‮ ‬مُحَمَّدٍ‮ ‬كَمَا‭ ‬صَلَّيْتَ‭ ‬عَلَى‭ ‬اِبْرَاهِيمَ‭ ‬وَعَلَى‭ ‬آلِ‮ ‬اِبْرَاهِيمَ‭ ‬اِنَّكَ‭ ‬حَمِيدٌ‭ ‬مَجِيدٌ‭. ‬اَللّٰهُمَّ‭ ‬بَارِكْ‭ ‬عَلَى‭ ‬مُحَمَّدٍ‭ ‬وَعَلَى‭ ‬آلِ‮ ‬مُحَمَّدٍ‭ ‬كَمَا‭ ‬بَارَكْتَ‭ ‬عَلَى‭ ‬اِبْرَاهِيمَ‭ ‬وَعَلَى‭ ‬آلِ‮ ‬اِبْرَاهِيمَ‭ ‬اِنَّكَ‭ ‬حَمِيدٌ‭ ‬مَجِيدٌ‭.‬`,
  translation_text: `Уа, Алла (Пайғамбарымыз) Мұхаммедке және оның отбасына Ибраһим пайғамбарға және отбасына мейірімділік танытқаныңдай мейірімділік көрсет. Еш күмәнсіз, Сен Хамид және Мәжидсің.
Уа, Алла (Пайғамбарымыз) Мұхаммедті және оның отбасын, Ибраһим пайғамбарды және отбасын мүбәрак қылғаныңдай мүбәрак қыл. Еш күмәнсіз, Сен Хамид және Мәжидсің.`,
  translation_text_ru: `О, Аллах! Прояви милосердие к Пророку Мухаммеду и его семье так как был милосерден Пророку Ибраһим и его семье. Без сомнении, Ты Хамид и Маджид.
 О, Аллах! Благослави Пророка Мухаммеда и его семью, как благославил Пророка Ибраһим и его семью. Без сомнении, Ты Хамид и Маджид.`,
  translation_text_tt: `ۋا، اللا (پايعامبارىمىز) مۇحاممەدكە جانە ونىڭ وتباسىنا يبراھيم پايعامبارعا جانە وتباسىنا مەيىرىمدىلىك تانىتقانىڭداي مەيىرىمدىلىك كورسەت. ەش كۇمانسىز، سەن حاميد جانە ءماجيدسىڭ.
ۋا، اللا (پايعامبارىمىز) مۇحاممەدتى جانە ونىڭ وتباسىن، يبراھيم پايعامباردى جانە وتباسىن مۇباراك قىلعانىڭداي مۇباراك قىل. ەش كۇمانسىز، سەن حاميد جانە ءماجيدسىڭ.`
}

export const multazam = {
  audio_url: multazam_audio,
  title: 'Мүлтәзәм',
  title_ru: 'Мультазам',
  title_tt: `ءمۇلتازام`,
  prayer_text: `اَللّٰهُمَّ‭ ‬لَكَ‭ ‬الْحَمْدُ‭ ‬حَمْدًا‭ ‬يُوَافِى‭ ‬نِعَمَكَ‭ ‬وَيُكافِى‭ ‬مَزِيدَكَ‭ ‬اَحْمَدُكَ‭ ‬بِجَمِيعِ‭ ‬مَحَامِدِكَ‭ ‬ما‭ ‬عَلِمْتُ‭ ‬مِنْهَا‭ ‬وَمَا‭ ‬لَمْ‭ ‬اََعْلَمْ‭ ‬عَلَى‭ ‬جَمِيعِ‭ ‬نِعَمِكَ‭ ‬مَا‭ ‬عَلِمْتُ‭ ‬مِنْهَا‭ ‬وَمَا‭ ‬لَمْ‭ ‬اََعْلَمْ‭.`,
  translation_text: 'Уа, Раббым! Саған нығметтеріңнің санындай мадақ айтамын. Мен білетін және білмейтін барлық нығметтерің үшін ұлы затыңа лайық болатын барша мақтаулармен Саған мақтау айтамын.',
  translation_text_ru: `О, Аллах! Восхваляю тебя так, как число твоих благословений. Хвала Аллаху за все твои знающие и незнающие благословения, которые уместны твоим великим делам.`,
  translation_text_tt: 'ۋا، راببىم! ساعان نىعمەتتەرىڭنىڭ سانىنداي ماداق ايتامىن. مەن بىلەتىن جانە بىلمەيتىن بارلىق نىعمەتتەرىڭ ءۇشىن ۇلى زاتىڭا لايىق بولاتىن بارشا ماقتاۋلارمەن ساعان ماقتاۋ ايتامىن.'
}
