import circle1_audio1 from '../../assets/circle-1.mp3'
import circle1_audio2 from '../../assets/circle-2.mp3'
import circle1_audio3 from '../../assets/circle-3.mp3'
import circle1_audio4 from '../../assets/circle-4.mp3'
import circle1_audio5 from '../../assets/circle-5.mp3'
import circle1_audio6 from '../../assets/circle-6.mp3'
import circle1_audio7 from '../../assets/circle-7.mp3'
const circles = [
  {
    id: 'circle1_audio1',
    audio_url: circle1_audio1,
    title: '1 - айналым',
    title_ru: '1 - круг',
    title_tt: `اۋاپتىڭ 1-اينالىمىندا وقىلاتىن دۇعا`,
    prayer_text: `سُبْحَانَ اللهِ وَالْحَمْدُ لِلهِ وَلَا اِلٰهَ اِلَّا اللهُ وَاللهُ اََكْبَرُ. وَلَا حَوْلَ وَلَا قُوَّةَ اِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. اَللّٰهُمَّ  اِيمَانًا بِكَ وَتَصْدِيقًا بِكِتَابِكَ وَوَفَاءً بِعهْدِكَ وَاِتِّبَاعًا لِسُنَّةِ نَبِيِّكَ وَحَبِيبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَـلَّمَ. اَللّٰهُمَّّ اِنِّى اَسْاََلُكَ الْعَفْوَ وَالْعَافِيَةَ وَالْمُعَافَاةَ الدَّائِمَةَ فِي الدِّينِ وَالدُّنْيَا وَالْاَخِرَةَ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ بِرَحْمَتِكَ يَا اَرْحَمَ الرَّاحِمِينَ. `,
    translation_text: `Алланы бүкіл кемшілік атаулыдан пәктеймін. Мадақ Оған тән. Алладан басқа құдай жоқ. Алла ұлы. Барлық күш пен құдірет ұлы Аллаға тән. Алланың игілігі мен сәлемі Пайғамбарымызға (с.а.у.) болсын.
 Уа, Алла! Өзіңе иман келтіріп, кітабыңды растап, Саған берген уәдемізді орындау үшін әрі сүйікті пайғамбарың Мұхаммедтің (с.а.у.) сүннетіне мойынсұнып құзырыңа келіп отырмын. Алланың игілігі мен сәлемі Пайғамбарымыз Мұхаммедке (с.а.у.) болсын.
Уа, Алла! Дініме, дүниеме және ақыретіме тиісті барлық істерімде Сенен кешірім, амандық тілеймін. Уа, мейірімділердің ең мейірімдісі! Мейіріміңмен жұмағыңа кіргізіп, тозағыңнан қашық қыла көр. Пайғамбарымыз Мұхаммедке (с.а.у.) және оның отбасы мен сахабаларына Алланың игілігімен сәлемі болсын!`,
    translation_text_ru: `Аллах Пречист. Вся хвала принадлежит Аллаху. Нет бога, кроме Аллаха. Аллах велик. Вся сила и могущество принадлежат Великому Аллаху.
Мир и благословение Посланнику Аллаха.
О Аллах! Я пришел сюда, уверовав в Тебя, приняв Твою Книгу, выполняя данное Тебе обещание и следуя сунне Пророка (с.а.в.).
О Аллах! Я прошу Тебя о прощении в этой жизни и вечной, о благополучии и здоровье. О милостивейший из милостивых, я прошу Тебя даровать мне Рай и спасти от Ада Твоей милостью.
`,
    translation_text_tt: `اللانى بۇكىل كەمشىلىك اتاۋلىدان پاكتەيمىن. ماداق وعان ءتان. اللادان باسقا قۇداي جوق. اللا ۇلى. بارلىق كۇش پەن قۇدىرەت ۇلى اللاعا ءتان. اللانىڭ يگىلىگى مەن سالەمى پايعامبارىمىزعا (س.ا.ۋ.) بولسىن.
ۋا، اللا! وزىڭە يمان كەلتىرىپ، كىتابىڭدى راستاپ، ساعان بەرگەن ۋادەمىزدى ورىنداۋ ءۇشىن ءارى سۇيىكتى پايعامبارىڭ مۇحاممەدتىڭ (س.ا.ۋ.) سۇننەتىنە مويىنسۇنىپ قۇزىرىڭا كەلىپ وتىرمىن. اللانىڭ يگىلىگى مەن سالەمى پايعامبارىمىز مۇحاممەدكە (س.ا.ۋ.) بولسىن.
ۋا، اللا! دىنىمە، دۇنيەمە جانە اقىرەتىمە ءتيىستى بارلىق ىستەرىمدە سەنەن كەشىرىم، اماندىق تىلەيمىن. ۋا، مەيىرىمدىلەردىڭ ەڭ مەيىرىمدىسى! مەيىرىمىڭمەن جۇماعىڭا كىرگىزىپ، توزاعىڭنان قاشىق قىلا كور. پايعامبارىمىز مۇحاممەدكە (س.ا.ۋ.) جانە ونىڭ وتباسى مەن ساحابالارىنا اللانىڭ يگىلىگىمەن سالەمى بولسىن!`
  },
  {
    id: 'circle1_audio2',
    audio_url: circle1_audio2,
    title: '2 - айналым',
    title_ru: '2 - круг',
    title_tt: `تاۋاپتىڭ 2-اينالىمىندا وقىلاتىن دۇعا`,
    prayer_text: `اَللّٰهُمَّ اِنَّ هٰذَا البَيْتَ بَيْتُكَ وَالْحَرَمَ حَرَمُكَ وَالْعَبْدَ عَبْدُكَ وَاَنَا عَبْدُكَ وَابْنُ عَبْدُكَ وَهٰذَا مَقَامُ الْعَائِذِ بِكَ مِنَ النَّارِ فَحَرِّمْ لُحُوْمَنَا وَبَشَرَتَنَا عَلَي النَّارِ. اَللّٰهُمَّّ حَبِّبْ اِلَيْنَا اْلاِيْمَانَ وَزَيِّنْهُ فِى قُلُوبِنَا وَكَرِّهْ اِلَيْنَا الْكُفْرَ وَالْفُسُوْقَ وَالْعِصْيَانَ وَاجْعَلْنَا مِنَ الرَّاشِدِيْنَ. اَللّٰهُمَّ قِنِى عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادُكَ. اَللّٰهُمَّ ارْزُقْنِى الْجَنَّةَ بِغَيْرِ حِسَابٍ.`,
    translation_text: `Уа, Алла! Бұл үй – Сенің үйің, Бұл Харам  – Сенің Харамың. Мына адамдар Сенің құлың, мен де Сенің құлыңмын. Бұл жер тозақ азабынан Саған сиынатын жер. Бізді тозақ отынан сақтай көр.
Уа, Алла! Бізге иманды сүйдіріп, жүрегімізге ұялат. Күпірлікті, бұзақылық пен асылықты жеккөргіз. Тура жолдағылардың қатарынан қыл.
Уа, Алла! Құлдарың қайта тірілетін күнде азабыңнан сақта. Уа, Алла! Жұмағыңа есеп-қисапсыз кіргізе көр.`,
    translation_text_ru: `О Аллах! Этот Дом - Твой Дом, и это заповедное место - Твое место, и это безопасное место - место, которое Ты обезопасил. Это - Твои рабы, и я - Твой раб. Это - место оберегающееся Тобой от адского пламени! Господь мой, сделай наши тела запретными для адского огня.
Господь мой, наполни наши души любовью к религии, укрась ей наши сердца. Отврати нас от неверия, грехов и непокорности Тебе.Помоги нам следовать по верному пути.
О Аллах! Сохрани меня от мучений в день, когда Ты воскресишь Своих рабов. Даруй мне безграничный удел в Раю.`,
    translation_text_tt: `ۋا، اللا! بۇل ءۇي – سەنىڭ ءۇيىڭ، بۇل حارام – سەنىڭ حارامىڭ. مىنا ادامدار سەنىڭ قۇلىڭ، مەن دە سەنىڭ قۇلىڭمىن. بۇل جەر توزاق ازابىنان ساعان سيىناتىن جەر. ءبىزدى توزاق وتىنان ساقتاي كور.
ۋا، اللا! بىزگە يماندى ءسۇيدىرىپ، جۇرەگىمىزگە ۇيالات. كۇپىرلىكتى، بۇزاقىلىق پەن اسىلىقتى جەككورگىز. تۋرا جولداعىلاردىڭ قاتارىنان قىل.
ۋا، اللا! قۇلدارىڭ قايتا تىرىلەتىن كۇندە ازابىڭنان ساقتا. ۋا، اللا! جۇماعىڭا ەسەپ-قيساپسىز كىرگىزە كور.`
  },
  {
    id: 'circle1_audio3',
    audio_url: circle1_audio3,
    title: '3 - айналым',
    title_ru: '3 - круг',
    title_tt: `تاۋاپتىڭ 3-اينالىمىندا وقىلاتىن دۇعا`,
    prayer_text: `اَللّٰهُمَّ اِنِّى اَعُوذُ بِكَ مِنَ الشَّكِّ والشِّرْكِ والشِّقَاقِ والنِّـفَاقِ وَسُوءِ الْاَخْلَاقِ وَسُوءِ الْمَنْظَرِ وَالْمُنْقَلَبِ فِي الْمَالِ وَالْاَهْلِ وَاْلوَلَدِ. اَللّٰهُمَّ اِنِّى اَسْاَلُكَ رِضَاكَ وَالْجَنَّةَ وَاَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّار. اَللّٰهُمّّ اِنِّى اَعُوذُ بِكَ مِنْ فِتْنَةِ الْقَبْرِ وَاَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَاَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ.`,
    translation_text: `Уа, Алла! Сенің бар екеніңе күмән келтіруден, Саған серік қосудан, ажырап қалудан, екіжүзділіктен, жаман мінезден, қиын жағдайға душар болудан, дүние-мүлкіме, отбасыма және балаларыма нашар күйде оралудан Өзіңе сиынамын.
Уә, Алла! Рақымшылығың мен жәннәтіңді сұраймын. Қаһарың мен  тозағыңнан Саған сыйынамын.
Уа, Алла, тозақ отынан, қабір азабынан, дәджалдың фитнасынан, өмір мен өлім фитнасынан (шайтанның азғыруынан) Саған сыйынамын.`,
    translation_text_ru: `О Аллах! Я прибегаю к Твоей защите от сомнения, неверия, отклонения от верного пути, несогласия, безнравственности, несчастья, которое может случиться со мной, моей семьей или имуществом.
О Аллах! Я прошу Тебя о Твоем довольстве и Рае. Я прибегаю к Твоей защите от Твоего гнева и адского Огня.
О Аллах! Я прибегаю к Тебе от искушения жизни и смерти.`,
    translation_text_tt: `ۋا، اللا! سەنىڭ بار ەكەنىڭە كۇمان كەلتىرۋدەن، ساعان سەرىك قوسۋدان، اجىراپ قالۋدان، ەكىجۇزدىلىكتەن، جامان مىنەزدەن، قيىن جاعدايعا دۋشار بولۋدان، دۇنيە-مۇلكىمە، وتباسىما جانە بالالارىما ناشار كۇيدە ورالۋدان وزىڭە سيىنامىن.
ءۋا، اللا! راقىمشىلىعىڭ مەن ءجانناتىڭدى سۇرايمىن. قاھارىڭ مەن توزاعىڭنان ساعان سىيىنامىن.
ۋا، اللا، توزاق وتىنان، قابىر ازابىنان، ءدادجالدىڭ فيتناسىنان، ءومىر مەن ءولىم فيتناسىنان (شايتاننىڭ ازعىرۋىنان) ساعان سىيىنامىن.`
  },
  {
    id: 'circle1_audio4',
    audio_url: circle1_audio4,
    title: '4 - айналым',
    title_ru: '4 - круг',
    title_tt: `تاۋاپتىڭ 4-اينالىمىندا وقىلاتىن دۇعا`,
    prayer_text: `اَللّٰهُمَّ اجْعَلْهُ حَجًّا مَبْرُوْرًا وَذَنْبًا مَغْفُوْرًا وَسَعْيًا مَشْكُوْرًا وَعَمَلًا صَالِحًا مَقْبُوْلًا وَتِجَارَةً لَنْ تَبُوْرَ . يَا عَالِمَ مَا فِى الصُّدُورِ اَخْرِجْنِى يَا اللهُ مِنَ الظُّلُمَاتِ اِلَي النُّوْرِ. اَللّٰهُمَّ اِنِّى اَسْاَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَآئِمَ مَغْفِرَتِكَ وَالسَّلَامَةَ مِنْ كُلِّ اِثْمٍ وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ. رَبِّ قَنِّعْنِى بِمَا رَزَقْتَنِى وَبَارِكْ لِى فِيْمَا اَعْطَيْتَنِى وَاخْلُفْ عَلَى كُلِّ غَائِبَةٍ لِى مِنْكَ بِخَيْرٍ.`,
    translation_text: `Уа, Алла! Қажылығымызды қабыл ал. Күнәларымызды кешір. Еңбегімізді жандыр. Игі істерімізді қабыл ал. саудамызды зиянсыз қыл.  Уа, жүректе жасырынғанды білуші! Бізді қараңғы зұлматтан айдындаған нұрға шығара көр. 
Уа, Алла! Сенен мейіріміңе жеткізетін амал жасауымызды, кешіріміңе себеп болатын қажыр-қайрат, түрлі жаман, күнәлі істерден арылуды, барлық жақсылықтарға қол жеткізуді, жәннатыңа кіріп, тозағыңнан құтылуды тілейміз.
Уа, Алла! Рызығыңа қанағатымды арттыр, бергеніңнің берекесін арттыр. Жоғалтқандарымнан да  жақсысын бере көр.`,
    translation_text_ru: `О Аллах! Сделай мой хадж благодатным, мой са’й - благодарным, мои деяния - благими, а мою торговлю - прибыльной. О Господь, ведающий то, что происходит в сердцах. О Аллах! Выведи меня из темноты к свету.
О Аллах! Даруй мне милость ; прошу тебя о том, что приведет меня к Твоему прощению; об избавлении от грехов; о благах; о Рае и о спасении от адского пламени.
О Господь! Сделай меня довольным тем уделом, который Ты мне дал; даруй мне благо в том, что Ты мне дал. Даруй мне нечто лучшее, чем то, что я потерял.`,
    translation_text_tt: `ۋا، اللا! قاجىلىعىمىزدى قابىل ال. كۇنالارىمىزدى كەشىر. ەڭبەگىمىزدى جاندىر. يگى ىستەرىمىزدى قابىل ال. ساۋدامىزدى زيانسىز قىل. ۋا، جۇرەكتە جاسىرىنعاندى ءبىلۋشى! ءبىزدى قاراڭعى زۇلماتتان ايدىنداعان نۇرعا شىعارا كور.
ۋا، اللا! سەنەن مەيىرىمىڭە جەتكىزەتىن امال جاساۋىمىزدى، كەشىرىمىڭە سەبەپ بولاتىن قاجىر-قايرات، ءتۇرلى جامان، كۇنالى ىستەردەن ارىلۋدى، بارلىق جاقسىلىقتارعا قول جەتكىزۋدى، ءجانناتىڭا كىرىپ، توزاعىڭنان قۇتىلۋدى تىلەيمىز.
ۋا، اللا! رىزىعىڭا قاناعاتىمدى ارتتىر، بەرگەنىڭنىڭ بەرەكەسىن ارتتىر. جوعالتقاندارىمنان دا جاقسىسىن بەرە كور.`
  },
  {
    id: 'circle1_audio5',
    audio_url: circle1_audio5,
    title: '5 - айналым',
    title_ru: '5 - круг',
    title_tt: `تاۋاپتىڭ 5-اينالىمىندا وقىلاتىن دۇعا`,
    prayer_text: `اَللّٰهُمَّ اَظِلِّنِى تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ اِلاَّ ظِلُّكَ وَلاَ بَاقِىَ اِلاَّ وَجْهُكَ وَاسْقِنِى مِنْ حَوْضِ نَبِيِّنا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شُرْبةً هَنِيئَةً مَرِيئَةً لاَ نَظْمَاَ بَعْدَها اَبَداً. اَللّٰهُمَّ اِنِّى اَسْاَلُكَ مِنْ خَيْرِ مَا سَاَلَكَ مِنْهُ نَبِيُّكَ سَيِّدُنَا مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاَعُوْذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَكَ مِنْهُ نَبِيُّكَ سَيِّدُنَا مُحَمَّدٌ صَلَّي اللهُ عَلَيْهِ وَسَلَّمَ. اَللّٰهُمَّ اِنِّى اَسْاَلُكَ الْجَنَّةَ وَنَعِيمَهَا وَمَا يُقَرِّبُنِى اِلَيْهَا مِنْ قَوْلٍ اَوْ فِعْلٍ اَوْ عَمَلٍ.`,
    translation_text: `Уа, Алла! Сенің көлеңкеңнен басқа ешқандай көлеңке, Сенің жамалыңнан басқа ешқандай адам қалмағанда Аршыңның көлеңкесінде саялата көр. Ешқашан сусамайтындай Пайғамбарымыз Мұхаммедтің (с.а.у.)  қауызынан шөлімді қандыр.
Уа, Алла! Пайғамбарымыз (с.а.у.) Сенен қандай жақсылық тілесе, мен де соны тілеймін, Пайғамбарымыз  (с.а.у.) нендей нәрседен сиынса, мен де одан Саған сиынамын.
Уә, Алла! Сенен жәннәтіңді, нығметіңді сұраймын. Жұмағыңа жақындатар сөз, іс, амал сұраймын.`,
    translation_text_ru: `О Аллах! Я прошу Тебя укрыть меня в тени Своего Трона и позволить мне напиться из источника Пророка, чтобы я больше никогда не испытывал жажды, в день, когда не будет другой тени, кроме Твоей.
О Аллах! Я прошу у Тебя тех же благ, о которых просил наш Пророк, и прибегаю к Твоей защите от всего, от чего прибегал он!
О Аллах! Я прошу Тебя о Рае, о благах и о таких словах, поступках и деяниях, которые приблизят меня к Твоему Раю.`,
    translation_text_tt: `ۋا، اللا! سەنىڭ كولەڭكەڭنەن باسقا ەشقانداي كولەڭكە، سەنىڭ جامالىڭنان باسقا ەشقانداي ادام قالماعاندا ارشىڭنىڭ كولەڭكەسىندە سايالاتا كور. ەشقاشان سۋسامايتىنداي پايعامبارىمىز مۇحاممەدتىڭ (س.ا.ۋ.) قاۋىزىنان ءشولىمدى قاندىر.
ۋا، اللا! پايعامبارىمىز (س.ا.ۋ.) سەنەن قانداي جاقسىلىق تىلەسە، مەن دە سونى تىلەيمىن، پايعامبارىمىز (س.ا.ۋ.) نەندەي نارسەدەن سيىنسا، مەن دە ودان ساعان سيىنامىن.
ءۋا، اللا! سەنەن ءجانناتىڭدى، نىعمەتىڭدى سۇرايمىن. جۇماعىڭا جاقىنداتار ءسوز، ءىس، امال سۇرايمىن.`
  },
  {
    id: 'circle1_audio6',
    audio_url: circle1_audio6,
    title: '6 - айналым',
    title_ru: '6 - круг',
    title_tt: `تاۋاپتىڭ 6-اينالىمىندا وقىلاتىن دۇعا`,
    prayer_text: `اَللّٰهُمَّ اِنَّ لَكَ عَلَىَّ حُقُوقاً كَثِيرَةً فِيمَا بَيْنِى وَبَيْنَكَ وَحُقُوقاً كَثِيرَةً فيما فِيمَا بَيْنِى وَبَيْنَ خَلْقِكَ. اَللّٰهُمَّ مَا كَانَ لَكَ فَاغْفِرْهُ لِى وَ مَا كَانَ لِخَلْقِكَ فَتَحَمَّلْهُ عَنِّى وَاَغْنِنِى بِحَلالِكَ عَنْ حَرَامِكَ وَ بِطَاعَتِكَ عَنْ مَعْصِيَتِكَ وَبِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ الْمَغْفِرَةِ.اَللّٰهُمَّ اِنَّ بَيْتَكَ عَظِيْمٌ وَوَجْهَكَ كَرِيْمٌ وَاَنْتَ يَا اَللهُ حَلِيْمٌ كَرِيمٌ عَظِيمٌ تُحِبُّ اْلعَفْوَ فَاعْفُ عَنِّى.`,
    translation_text: `Уа, Алла! Сенің де, Сенің жаратқан басқа мақұлықтарыңның да талай ақысын жеп, құқығын аяқ асты еттім. Мойнымдағы сол ақыларды кешіруіңді, мені сол күнәлардан құтқаруыңды тілеймін.
Уа, кешірімі мол Жаратқан Ием! Маған харамға беттемейтіндей етіп халалыңды көрсет. Күнә жасатпайтындай ғибадат бер. Сенен басқаға мұқтаж болмайтындай жақсылық бер.  
Уа, Алла! Сенің үйің қасиетті, Өзің асқан жомартсың. Уа, Алла! Сен ұлысың, мейірімдісің, кешірімдісің! Кешіргенді жақсы көресің, мені де кеше көр!`,
    translation_text_ru: `О Аллах! У Тебя и созданных Тобой есть много прав по отношению ко мне. Прости Свои права по отношению ко мне и возьми на Себя права созданных Тобой по отношению ко мне.
О Всепрощающий Господь, избавь меня от запрещённого Тобой посредством дозволенного Тобой, и избавь меня от ослушания Тебя посредством повиновения Тебе, и по милости Твоей избавь меня от необходимости в ком бы то ни было, кроме Тебя.
О Аллах! Твой Дом велик, а Ты Щедр. Ты - Кроткий, Щедрый. Ты любишь прощать, так прости же меня.`,
    translation_text_tt: `ۋا، اللا! سەنىڭ دە، سەنىڭ جاراتقان باسقا ماقۇلىقتارىڭنىڭ دا تالاي اقىسىن جەپ، قۇقىعىن اياق استى ەتتىم. موينىمداعى سول اقىلاردى كەشىرۋىڭدى، مەنى سول كۇنالاردان قۇتقارۋىڭدى تىلەيمىن.
ۋا، كەشىرىمى مول جاراتقان يەم! ماعان حارامعا بەتتەمەيتىندەي ەتىپ حالالىڭدى كورسەت. كۇنا جاساتپايتىنداي عيبادات بەر. سەنەن باسقاعا مۇقتاج بولمايتىنداي جاقسىلىق بەر.
ۋا، اللا! سەنىڭ ءۇيىڭ قاسيەتتى، ءوزىڭ اسقان جومارتسىڭ. ۋا، اللا! سەن ۇلىسىڭ، مەيىرىمدىسىڭ، كەشىرىمدىسىڭ! كەشىرگەندى جاقسى كورەسىڭ، مەنى دە كەشە كور!`
  },
  {
    id: 'circle1_audio7',
    audio_url: circle1_audio7,
    title: '7 - айналым',
    title_ru: '7 - круг',
    title_tt: `تاۋاپتىڭ 7-اينالىمىندا وقىلاتىن دۇعا`,
    prayer_text: `اَللّٰهُمَّ اِنِّى اَسْاَلُكَ اِيْمَانًا كَامِلًا وَيَقِينًا صَادِقًا وَرِزْقًا وَاسِعًا وَقَلْبًا خَاشِعًا وَلِسَانًا ذَاكِرًا وَحَلَالًا طَيِّبًا وَتَوْبَةً نَصُوحًا قَبْلَ الْمَوْتِ وَرَاحَةً عِنْدَ الْمَوْتِ وَمَغْفِرَةً وَرَحْمَةً بَعْدَ الْمَوْتِ وَاْلعَفْوَ عِنْدَ الْحِسَابِ وَاْلفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ بِرَحْمَتِكَ يَاعَزِيزُ يَاغَفَّارُ. رَبِّ زِدْنِي عِلْمًا وَاَلْحِقْنِى بِالصَّالِحِينَ.`,
    translation_text: `Уа, Алла! Сенен кәміл иман, шынайы сенім, мол ризық, Саған мойынсұнатын жүрек, әрдайым Сені зікір ететін тіл, таза және адал табыс, өлгенше бұзылмайтын шынайы тәубе, жеңіл өлім, өлгеннен кейін мейірім, әділетті құзырыңда есеп берер шақта кешірім, жәннәтқа кіруді және жаһаннамнан құтылуды тілеймін. Уа, ғазиз әрі кешірімшіл Алла, дұғамды қабыл ете көр. Уа, Раббым, білімімді арттырып, ізгілердің қатарына қоса көр.`,
    translation_text_ru: `О Великий, Прощающий! Одари меня крепкой верой, щедрым уделом, богобоязненным сердцем, поминающем Тебя языком, чистым и разрешенным пропитанием. Даруй мне искреннее раскаяние перед смертью, спокойствие в момент смерти, милость и прощение после смерти. Я прошу Тебя даровать мне Рай и спасти от Ада в Судный день. Господь мой, приумножь мои знания и введи меня в число праведных рабов.`,
    translation_text_tt: `ۋا، اللا! سەنەن كامىل يمان، شىنايى سەنىم، مول ريزىق، ساعان مويىنسۇناتىن جۇرەك، ءاردايىم سەنى زىكىر ەتەتىن ءتىل، تازا جانە ادال تابىس، ولگەنشە بۇزىلمايتىن شىنايى تاۋبە، جەڭىل ءولىم، ولگەننەن كەيىن مەيىرىم، ادىلەتتى قۇزىرىڭدا ەسەپ بەرەر شاقتا كەشىرىم، جانناتقا كىرۋدى جانە جاھاننامنان قۇتىلۋدى تىلەيمىن. ۋا، عازيز ءارى كەشىرىمشىل اللا، دۇعامدى قابىل ەتە كور. ۋا، راببىم، ءبىلىمىمدى ارتتىرىپ، ىزگىلەردىڭ قاتارىنا قوسا كور.`
  }
]
export type Prayer = {
  id: string
  audio_url: string
  title: string
  title_ru: string
  title_tt: string
  prayer_text: string
  translation_text: string
  translation_text_ru: string
  translation_text_tt: string
}

export default circles
