import qurban_audio from '../../assets/qurban.mp3'
import travel_begin_audio from '../../assets/travel_begin.mp3'
import when_entering_car_audio from '../../assets/when_entering_car.mp3'
import throwing_stone_shaitan_audio from '../../assets/throwing_stone_shaitan.mp3'
import hairhut_audio from '../../assets/haircut.mp3'

export const hairhut = {
  audio_url: hairhut_audio,
  title: 'Отсутсвует',
  title_ru: 'Отсутсвует',
  title_tt: `Отсутсвует`,
  prayer_text: `Отсутсвует`,
  translation_text: `Отсутсвует`,
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: `Отсутсвует`
}
export const qurban = {
  audio_url: qurban_audio,
  title: 'Отсутсвует',
  title_ru: 'Отсутсвует',
  title_tt: `Отсутсвует`,
  prayer_text: `Отсутсвует`,
  translation_text: `Отсутсвует`,
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: `Отсутсвует`
}
export const travel_begin = {
  audio_url: travel_begin_audio,
  title: 'САПАРҒА ШЫҒАРДА ОҚЫЛАТЫН ДҰҒА',
  title_ru: 'ДУА, ЧИТАЕМАЯ ПРИ ПОЕЗДКЕ',
  title_tt: `ساپارعا شىعاردا وقىلاتىن دۇعا`,
  prayer_text: `رَبِّ اَدْخِلْنِى مُدْخَلَ صِدْقٍ وَاَخْرِجْنِى مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا. اَللّٰهُمَّ بِكَ اَسْتَعِينُ، وَعَلَيْكَ اَتَوَكَّلُ، اَللّٰهُمَّ ذَلِّلْ لِى صُعُوبَةَ اَمْرِى، وَسَهِّلْ عَليَّ مَشَقَّةَ سَفَرِى، وَارْزُقْنِى مِنَ الْخَيْرِ اَكْثَرَ مِمَّا اَطْلُبُ، وَاصْرِفْ عَنِّى كُلَّ شَرٍّ، رَبّ اشْرَحْ لِي صَدْرِى، وَيَسِّرْ لِى اَمْرِى، اَللّٰهُمّ اِنِّى اَسْتَحْفِظُكَ واَسْتَوْدِعُكَ نَفْسِى وَدِينِى واَهْلِى واَقارِبى وكُلَّ مَا اَنْعَمْتَ عَلَىَّ وَعَليْهِمْ بِهِ مِنْ آخِرَةٍ وَدُنْيَا، فَاحْفَظْنَا اَجْمَعِينَ مِنْ كُلِّ سُوءٍ يا كَرِيمُ.`,
  translation_text: `Уа, Раббым! Маған қандай да бір жерге аяқ басқанымда, хақ мақсатпен, шынайы ниетпен һәм Өзіңе шын берілген күйде кіруді, сондай-ақ ол жерден шығарда да хақ мақсатпен, шынайы ниетпен һәм Өзіңе шын берілген күйде шығуды нәсіп еткейсің. Әрі Өз тарапыңнан маған мықты қолдау көрсетіп, айқын дәлел бергейсің.
Уа, Алла! Тек Сенен ғана көмек сұраймын және тек Саған сенемін. Уа, Алла! Осы ісімді және сапарымды жеңілдете көр. Маған қалағанымнан мол жақсылығыңды бере көр. Әртүрлі жаманшылықты менен алыс қыл. Уа, Раббым! Көкірегімді кең қылып, иман нұрына, ілімге толтыра көр.
Уа, Алла! Өзімді, дінімді, отбасымды, туыстарымды және дүние мен ақыретте беретін нығметтеріңнің барлығын Саған аманат еттім. Уа, сыйы мол Раббым! Бізді әртүрлі жаманшылықтан сақтай көр.`,
  translation_text_ru: `О, Аллах! Когда я вступлю в какое-либо место, дай мне войти с истинной целью, истинным намерение и преданностью, и когда я уйду оттуда, дай мне уйти с истинной целью, истинным намерением и преданностью. О, Аллах! Прошу помощи, прибегаю к твоей защите и верю я только в Тебя. 
О, Аллах! Облегчи мое это путешествие и действие. Прошу, дай мне только хорошее в этой жизни. Огороди меня от разных неприятностей. О, Господи! Наполни мое сердце светом веры и знания. О, Господи! Я доверяю себя, свою семью, родственников и все благославления, которые ты даешь в этой и в той жизни только Тебе. О, мой Господь, Вседарующий! Защити и сохрани нас от разных неприятностей.`,
  translation_text_tt: `ۋا، راببىم! ماعان قانداي دا ءبىر جەرگە اياق باسقانىمدا، حاق ماقساتپەن، شىنايى نيەتپەن ءھام وزىڭە شىن بەرىلگەن كۇيدە كىرۋدى، سونداي-اق ول جەردەن شىعاردا دا حاق ماقساتپەن، شىنايى نيەتپەن ءھام وزىڭە شىن بەرىلگەن كۇيدە شىعۋدى ءناسىپ ەتكەيسىڭ. ءارى ءوز تاراپىڭنان ماعان مىقتى قولداۋ كورسەتىپ، ايقىن دالەل بەرگەيسىڭ.
ۋا، اللا! تەك سەنەن عانا كومەك سۇرايمىن جانە تەك ساعان سەنەمىن. ۋا، اللا! وسى ءىسىمدى جانە ساپارىمدى جەڭىلدەتە كور. ماعان قالاعانىمنان مول جاقسىلىعىڭدى بەرە كور. ءارتۇرلى جامانشىلىقتى مەنەن الىس قىل. ۋا، راببىم! كوكىرەگىمدى كەڭ قىلىپ، يمان نۇرىنا، ىلىمگە تولتىرا كور.
ۋا، اللا! ءوزىمدى، ءدىنىمدى، وتباسىمدى، تۋىستارىمدى جانە دۇنيە مەن اقىرەتتە بەرەتىن نىعمەتتەرىڭنىڭ بارلىعىن ساعان امانات ەتتىم. ۋا، سىيى مول راببىم! ءبىزدى ءارتۇرلى جامانشىلىقتان ساقتاي كور.`
}
export const when_entering_car = {
  audio_url: when_entering_car_audio,
  title: 'КӨЛІККЕ МІНЕРДЕ ОҚЫЛАТЫН ДҰҒА',
  title_ru: 'ДУА, КОТОРАЯ ЧИТАЕТСЯ ПРИ ПОСАДКЕ В ТРАНСПОРТ',
  title_tt: `كولىككە مىنەردە وقىلاتىن دۇعا`,
  prayer_text: `بِسْمِ اللهِ مَجْرَاهَا وَ مُرْسٰاهَا اِنَّ رَبِّى لَغَفُورٌ رَحِيمٌ. سُبْحَانَ الَّذِى سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَاِنَّا اِلَى رَبِّنَا لَمُنْقَلِبُونَ. اَللّٰهُمَّ اِنَّا نَسْاَلُكَ فِى سَفَرِنَا هٰذَا الْبِرَّ وَالتَّقْوَى وَمِنَ الْعَمَلِ مَا تَرْضٰى. اَللّٰهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هٰذَا، وَاطْوِ عَنَّا بُعْدَهُ. اَللّٰهُمَّ اَنْتَ الصَّاحِبُ فِى السَّفَرِ وَالْخَلِيفَةُ فِى الاَهْلِ. اَللّٰهُمَّ اِنِّى اَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالاَهْلِ وَالْوَلَدِ.`,
  translation_text: `Оның (көліктің) жүйткіп жүзуі де, тоқтауы да Алланың атымен. Раббым, расында да, өте кешірімді, ерекше мейірімді. Бізге осы мініс көлікті бағынышты еткен Алла мінсіз, кемшілік атаулыдан пәк. Әйтпесе, біздің оған шамамыз жетпес еді. 
Уа, Алла! Бұл сапарымызда Сенен жақсылық тілейміз, тақуалық пен ризашылығыңа сай амал сұраймыз. Уа, Алла! Сапарымызды оң қылып, барар жерімізге аман-есен жеткіз. Уа, Алла! Сен сапарда Иемізсің, отбасымызға Қамқоршысың. Уа, Алла! Жол азабы мен қайғы-мұңнан, қайтқанда мал-мүлкіміз зая болып, отбасымыз бен балаларымыздың қиыншылыққа түскенін көруден сақта.`,
  translation_text_ru: `Его быстаря езда останавливается во имя Аллаха. Господи, во истине очень прощающий и особо милосердный. Аллах, который покорил нас своей ездой, безупречна, несовершенна и чиста от всех недостатков. Иначе, мы не сможем себе этого позволить. 
О, Аллах! В этом путешествии мы желаем всего наилучшего, просим благочестия и благодарности. О, Аллах! Сделай наш визит благополучным и веди нас целым невредимым. О, Аллах! Ты наш Покровитель в пути, ты Хранитель нашей семьи. О, Аллах! Храни нас от дорожных страданий и печали, от того, что по возвращении не видеть страдании семьи и детей, убытка имущества и скота.`,
  translation_text_tt: `ونىڭ (كولىكتىڭ) جۇيتكىپ ءجۇزۋى دە، توقتاۋى دا اللانىڭ اتىمەن. راببىم، راسىندا دا، وتە كەشىرىمدى، ەرەكشە مەيىرىمدى. بىزگە وسى ءمىنىس كولىكتى باعىنىشتى ەتكەن اللا ءمىنسىز، كەمشىلىك اتاۋلىدان پاك. ايتپەسە، ءبىزدىڭ وعان شامامىز جەتپەس ەدى.
ۋا، اللا! بۇل ساپارىمىزدا سەنەن جاقسىلىق تىلەيمىز، تاقۋالىق پەن ريزاشىلىعىڭا ساي امال سۇرايمىز. ۋا، اللا! ساپارىمىزدى وڭ قىلىپ، بارار جەرىمىزگە امان-ەسەن جەتكىز. ۋا، اللا! سەن ساپاردا يەمىزسىڭ، وتباسىمىزعا قامقورشىسىڭ. ۋا، اللا! جول ازابى مەن قايعى-مۇڭنان، قايتقاندا مال-مۇلكىمىز زايا بولىپ، وتباسىمىز بەن بالالارىمىزدىڭ قيىنشىلىققا تۇسكەنىن كورۋدەن ساقتا.ۋا، اللا! تەك سەنەن عانا كومەك سۇرايمىن جانە تەك ساعان سەنەمىن. ۋا، اللا! وسى ءىسىمدى جانە ساپارىمدى جەڭىلدەتە كور. ماعان قالاعانىمنان مول جاقسىلىعىڭدى بەرە كور. ءارتۇرلى جامانشىلىقتى مەنەن الىس قىل. ۋا، راببىم! كوكىرەگىمدى كەڭ قىلىپ، يمان نۇرىنا، ىلىمگە تولتىرا كور.
ۋا، اللا! ءوزىمدى، ءدىنىمدى، وتباسىمدى، تۋىستارىمدى جانە دۇنيە مەن اقىرەتتە بەرەتىن نىعمەتتەرىڭنىڭ بارلىعىن ساعان امانات ەتتىم. ۋا، سىيى مول راببىم! ءبىزدى ءارتۇرلى جامانشىلىقتان ساقتاي كور.`
}

export const throwing_stone_shaitan = {
  audio_url: throwing_stone_shaitan_audio,
  title: 'Отсутсвует',
  title_ru: 'Отсутсвует',
  title_tt: `Отсутсвует`,
  prayer_text: `Отсутсвует`,
  translation_text: `Отсутсвует`,
  translation_text_ru: `Отсутсвует`,
  translation_text_tt: `Отсутсвует`
}
