import qurban_audio from '../../assets/qurban.mp3'
import travel_begin_audio from '../../assets/travel_begin.mp3'
import when_entering_car_audio from '../../assets/when_entering_car.mp3'
import throwing_stone_shaitan_audio from '../../assets/throwing_stone_shaitan.mp3'
import hairhut_audio from '../../assets/haircut.mp3'
import at_muzdalifa_audio from '../../assets/at_muzdalifa.mp4'
import talbiya_audio from '../../assets/talbiya.mp4'
import { t } from 'ttag'

export const talbiya = {
  id: 'talbiya',
  audio_url: talbiya_audio,
  title: t`ТӘЛБИЯ`,
  title_ru: 'ТАЛЬБИЯ',
  title_tt: `ءتالبيا`,
  prayer_text: `لَبَّيْكَ اَللّٰهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، اِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ`,
  translation_text: `Уа, Алла! Шақыруыңды қабыл алып келіп тұрмын. Әміріңе бой ұсынып, әміріңді орындауға келдім. Сенің еш серігің жоқ. Барлық мадақ пен нығмет, шүбәсіз, Саған тән, мүлік те Сенікі. Сенің еш серігің жоқ.`,
  translation_text_ru: `Вот я перед тобой, о Аллах, нет у Тебя сотоварища, вот я перед Тобой. Поистине, хвала Тебе, и милость принадлежит Тебе и владычество, нет у Тебя сотоварища!`,
  translation_text_tt: `ۋا، اللا! شاقىرۋىڭدى قابىل الىپ كەلىپ تۇرمىن. امىرىڭە بوي ۇسىنىپ، ءامىرىڭدى ورىنداۋعا كەلدىم. سەنىڭ ەش سەرىگىڭ جوق. بارلىق ماداق پەن نىعمەت، ءشۇباسىز، ساعان ءتان، مۇلىك تە سەنىكى. سەنىڭ ەش سەرىگىڭ جوق.`
}

export const at_muzdalifa = {
  id: 'at_muzdalifa',
  audio_url: at_muzdalifa_audio,
  title: t`Мұздалифа уақфасында оқылатын дұға`,
  title_ru: 'Дуа во время стояния на Муздалифе',
  title_tt: `مۇزداليفا ۋاقفاسىندا وقىلاتىن دۇعا`,
  prayer_text: `اَللّٰهُ اََكْبَرُ اَللّٰهُ اََكْبَرُ لَا اِلٰهَ اِلَّا اللّٰهُ وَاللّٰهُ اََكْبَرُ اَللّٰهُ اََكْبَرُ وَلِلّٰهِ الْحَمْدُ. لَا اِلٰهَ اِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِى وَيُمِيتُ وَهُوَ حَىٌّ لَا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ. لَبَّيْكَ اَللّٰهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ اِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لَا شَرِيكَ لَكَ. رَبَّنَا آتِنَا فِى الدُّنْيَا حَسَنَةً وَفِى الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ. اَللّٰهُمَّ لَكَ الْحَمْدُ كُلُّهُ، وَلَكَ الكَمَالُ كُلُّهُ، وَلَكَ الْجَلالُ كُلُّهُ، وَلَكَ التَّقْدِيسُ كُلُّهُ، اَللّٰهُمَّ لَكَ الحَمْدُ حَمْداً يُوَافِى نِعَمَكَ، وَيُكافِى مَزِيدَكَ، اَحْمَدُكَ بِجَمِيعِ مَحَامِدِكَ مَا عَلِمْتُ مِنْهَا وَمَا لَمْ اََعْلَمْ عَلَى جَمِيعِ نِعَمِكَ مَا عَلِمْتُ مِنْهَا وَمَا لَمْ اََعْلَمْ، وَعَلَى كُلِّ حالٍ.اَللّٰهُمَّ صَلِّ وَسَلِّمْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ. اَللّٰهُمَّ لَكَ الْحَمْدُ كُلُّهُ، وَلَكَ الْكَمَالُ كُلُّهُ، وَلَكَ الْجَلَالُ كُلُّهُ، وَلَكَ التَّقْدِيسُ كُلُّهُ، اَللّٰهُمَّ اغْفِرْ لِى جَمِيعَ مَا اَسْلَفْتُهُ، وَاعْصِمْنِى فِيما بَقِىَ، وَارْزُقْنِى عَمَلاً صَالِحاً تَرْضَى بِهِ عنِّى يَا ذَا الفَضْلِ العَظِيمِ اَللّٰهُمَّ كَمَا وَقَّفْتَنا فِيهِ وَاََرَيْتَنَا إيَّاه، فَوَفِّقْنَا لِذِكْرِكَ كَمَا هَدَيْتَنَا، وَاغْفِرْ لَنَا وَارْحَمْنَا كَمَا وَعَدْتَنَا بِقَوْلِكَ وَقَوْلُكَ الْحَقِّ فَاِذَا اََفَضْتُمْ مِنْ عَرَفَاتٍ فَاذْكُرُوا اللّٰهَ عِنْدَ الْمَشْعَرِ الْحَرَامِ وَاذْكُرُوهُ كَمَا هَدَاكُمْ وَاِنْ كُنْتُمْ مِنْ قَبْلِهِ لَمِنَ الضَّالِّينَ، ثُمَّ اََفِيضُوا مِنْ حَيْثُ اََفَاضَ النَّاسُ وَاسْتَغْفِرُوا اللّٰهَ اِنَّ اللّٰهَ غَفُورٌ رَحِيمٌ. اَللّٰهُمَّ اِنِّى اَسْاَلُكَ اَنْ تَرْزُقَنِى فِى هٰذَا الْمَكَانِ جَوَامِعَ الخَيْرِ كُلِّهِ، وَاَنْ تُصْلَحَ شَاْنِى كُلَّهُ وَاَنْ تَمُنَّ عَلىَّ بِمَا مَنَنْتَ بِهِ عَلَى اَوْلِيائِكَ، وَاَنْ تَصْرِفَ عَنِّى الشَّرَّ كُلَّهُ فَاِنَّهُ لَا يَفْعَلُ ذَلِكَ غَيْرُكَ وَلَا يَجُودُ بِهِ اِلَّا اَنْتَ يَا اَرْحَمَ الرَّاحِمِينَ. اَللّٰهُمَّ اَعِذْنِى مِنَ الشَّيْطانِ الرَّجِيمِ، واََعِذْنِى مِنْ كُلِّ سُوءٍ، وَقَنِّعْنِى بِمَا رَزَقْتَنِى وَبَارِكْ لِى فِيهِ. اَللّٰهُمَّ اجْعَلْنِى مِنْ اََكْرَمِ وَفْدِكَ عَلَيْكَ وَاَلْزِمْنِى سَبِيلَ الْاِسْتِقَامَةِ حَتَّى اَلْقَاكَ يَا رَبَّ الْعَالَمِينَ`,
  translation_text: `Алла ұлы, Алла ұлы, Алладан басқа құдай жоқ. Алла ұлы, Алла ұлы, Барлық мадақ Аллаға тән. Алладан өзге құдай жоқ. Ол - жалғыз, ортағы жоқ. Мүлік Оның қолында, мадақ Оған арналады. Ол тірілтеді һәм өлтіреді. Ол тірі, ешқашан өлмейді. Жақсылық Оның қолында. Оның барлық нәрсеге күші жетеді. 
Уа, Алла! Шақыруыңды қабыл алып келіп тұрмын. Әміріңе бой ұсынып, әміріңді орындауға келдім. Сенің еш серігің жоқ. Барлық мадақ пен нығмет, шүбәсіз, Саған тән, мүлік те Сенікі. Сенің еш серігің жоқ. Уа, Раббымыз! Бізге дүние мен ақыретте жақсылығыңды беріп, тозақ отынан сақтай көр. 
Уа, Алла! Барлық мадақ Саған тән. Барша кемелділік Саған тиесілі. Биіктік толықтай Сенікі. Ұлылық тек Саған тән. Уа, Раббым! Саған нығметтеріңнің санындай мадақ айтамын. Мен білетін және білмейтін барлық нығметтерің үшін ұлы затыңа лайық болатын барша мақтаулармен Саған мақтау айтамын. 
Пайғамбарымызға (с.а.у.) және оның жанұясына Алланың игілігі мен сәлемі болсын. Уа, Раббым! Бүгінге дейін жасаған күнәларымды кешіріп, бұдан кейін кейін күнә жасаудан мені сақтай көр. Уа, жақсылық пен ұлылықтың Иесі! Сенің разы болатын амалдарыңды жасауымды нәсіп еткейсің. 
Уа, Алла! Арафатты көруді, уақфа жасауды бізге нәсіп еткеніңдей, бұл жерде де Өзің көрсеткендей Сені зікір етуді бізге нәсіп ет. Бізді жарылқап, мейіріміңе бөлей көр. Сен мұны: «Арафатта тұрғаннан кейін (бейне бір сел секілді Мұздалифаға қарай) ағылғандарыңда, Мәшғар ул-харамда (Мұздалифада) Алланы еске алыңдар. Ол сендерді қалай тура жолға салған болса, Оны дәл солай жақсылап еске алыңдар. Ол сендерді тура жолға салмай тұрып сендер адасып жүрген қауым едіңдер. Адамдар лек-легімен ағылған жерден сендер де ағылыңдар және Алладан кешірім тілеңдер. Шүбәсіз, Алла өте кешірімді, ерекше мейірімді», - деген сөздеріңмен бізге уәде еткен едің. Сенің уәдең хақ. 
Уа, Алла! Осы қасиетті жерде барша жақсылығыңды беріп,  халімді толықтай түзетуіңді, сүйікті құлдарыңа берген игіліктерді маған да беруіңді және барша жамандық атаулыдан қорғауыңды сұраймын. Мұны Сенен басқа ешкім жасай алмайды. Ең жақсысын Сен ғана жасайсың. Уа, мейірімділердің ең мейірімдісі! 
Уа, Алла! Мені қуылған шайтаннан, түрлі кесапаттан қорғай көр. Маған жететіндей рызық беріп, бергеніңді берекелі қыл. Уа, Раббым! Мені Саған келгендердің ең ізгілерінен қыл. Уа, күллі әлемнің Раббы! Саған қауышқанға дейін мені тура жолдан адастыра көрме.`,
  translation_text_ru: `Аллах велик. Аллах велик. Нет бога, кроме Аллаха. Аллах велик. Аллах велик. Вся хвала Аллаху. Нет бога, кроме Аллаха. Он один. Нет у Него сотоварища. Владычество принадлежит Ему. Хвала принадлежит Ему. Он над всякой вещью мощен.
Я перед Тобой, о Аллах! Я перед Тобой! Нет у Тебя сотоварища. Я перед Тобой! Несомненно, хвала принадлежит Тебе. Милость принадлежит Тебе, и владычество принадлежит Тебе. Нет у Тебя сотоварища.
Господь мой! Даруй нам благо в этом мире, и даруй нам благо в вечной жизни. Защити нас от мучений. О Аллах! Вся хвала принадлежит Тебе. Совершенство принадлежит Тебе. Величие принадлежит Тебе. Превосходство принадлежит Тебе. О Аллах! Хвала Тебе за все дарованные Тобой блага. Я восхваляю Тебя всеми известными и не известными мне способами за все известные и не известные мне милости. О Аллах! Мир и благословение Пророку и его семье. О Аллах! Прости мне все грехи, совершенные до сегодняшнего дня. Храни меня от грехов после сегодняшнего дня. О Обладатель щедрости и величия! Помоги мне совершать дела, которые приведут к Твоему довольству. О Аллах! Как Ты позволил нам увидеть Арафат и остановиться на нем, так позволь нам поминать Тебя должным образом. Прости нас. Помилуй нас.Ты пообещал нам это, сказав: «А когда вы вернетесь с Арафата, поминайте Аллаха в Заповедном месте. Поминайте Его, поскольку Он наставил вас на прямой путь, хотя прежде вы были одними из заблудших. Затем отправляйтесь в путь оттуда, откуда отправляются остальные люди, и молите Аллаха о прощении. Воистину, Аллах - Прощающий, Милосердный”. А Твое слово - истина. О Аллах! В этом благословенном месте я молю Тебя даровать мне блага, поправить мое положение, одарить меня тем, чем Ты одарил Твоих любимых рабов, и отдалить от меня все дурное. Никто не сможет сделать этого, кроме Тебя, и Ты устраиваешь все самым лучшим образом. О самый милосердный из милосердных! О Аллах! Защити меня от шайтана, побиваемого камнями. Защити меня от любых бед. Даруй мне достаточный удел и сделай его благодатным. О Аллах! Сделай меня одним лучших в числе тех, кто нашел путь к Тебе. О Господь миров! Сделай так, чтобы я не отклонялся от прямого пути до самой встречи с Тобой!`,
  translation_text_tt: `اللا ۇلى، اللا ۇلى، اللادان باسقا قۇداي جوق. اللا ۇلى، اللا ۇلى، بارلىق ماداق اللاعا ءتان. اللادان وزگە قۇداي جوق. ول - جالعىز، ورتاعى جوق. مۇلىك ونىڭ قولىندا، ماداق وعان ارنالادى. ول تىرىلتەدى ءھام ولتىرەدى. ول ءتىرى، ەشقاشان ولمەيدى. جاقسىلىق ونىڭ قولىندا. ونىڭ بارلىق نارسەگە كۇشى جەتەدى. 
ۋا، اللا! شاقىرۋىڭدى قابىل الىپ كەلىپ تۇرمىن. امىرىڭە بوي ۇسىنىپ، ءامىرىڭدى ورىنداۋعا كەلدىم. سەنىڭ ەش سەرىگىڭ جوق. بارلىق ماداق پەن نىعمەت، ءشۇباسىز، ساعان ءتان، مۇلىك تە سەنىكى. سەنىڭ ەش سەرىگىڭ جوق. ۋا، راببىمىز! بىزگە دۇنيە مەن اقىرەتتە جاقسىلىعىڭدى بەرىپ، توزاق وتىنان ساقتاي كور. 
ۋا، اللا! بارلىق ماداق ساعان ءتان. بارشا كەمەلدىلىك ساعان تيەسىلى. بيىكتىك تولىقتاي سەنىكى. ۇلىلىق تەك ساعان ءتان. ۋا، راببىم! ساعان نىعمەتتەرىڭنىڭ سانىنداي ماداق ايتامىن. مەن بىلەتىن جانە بىلمەيتىن بارلىق نىعمەتتەرىڭ ءۇشىن ۇلى زاتىڭا لايىق بولاتىن بارشا ماقتاۋلارمەن ساعان ماقتاۋ ايتامىن. 
پايعامبارىمىزعا (س.ا.ۋ.) جانە ونىڭ جانۇياسىنا اللانىڭ يگىلىگى مەن سالەمى بولسىن. ۋا، راببىم! بۇگىنگە دەيىن جاساعان كۇنالارىمدى كەشىرىپ، بۇدان كەيىن كەيىن كۇنا جاساۋدان مەنى ساقتاي كور. ۋا، جاقسىلىق پەن ۇلىلىقتىڭ يەسى! سەنىڭ رازى بولاتىن امالدارىڭدى جاساۋىمدى ءناسىپ ەتكەيسىڭ. 
ۋا، اللا! ارافاتتى كورۋدى، ۋاقفا جاساۋدى بىزگە ءناسىپ ەتكەنىڭدەي، بۇل جەردە دە ءوزىڭ كورسەتكەندەي سەنى زىكىر ەتۋدى بىزگە ءناسىپ ەت. ءبىزدى جارىلقاپ، مەيىرىمىڭە بولەي كور. سەن مۇنى: «ارافاتتا تۇرعاننان كەيىن (بەينە ءبىر سەل سەكىلدى مۇزداليفاعا قاراي) اعىلعاندارىڭدا، ماشعار ۋل-حارامدا (مۇزداليفادا) اللانى ەسكە الىڭدار. ول سەندەردى قالاي تۋرا جولعا سالعان بولسا، ونى ءدال سولاي جاقسىلاپ ەسكە الىڭدار. ول سەندەردى تۋرا جولعا سالماي تۇرىپ سەندەر اداسىپ جۇرگەن قاۋىم ەدىڭدەر. ادامدار لەك-لەگىمەن اعىلعان جەردەن سەندەر دە اعىلىڭدار جانە اللادان كەشىرىم تىلەڭدەر. ءشۇباسىز، اللا وتە كەشىرىمدى، ەرەكشە مەيىرىمدى»، - دەگەن سوزدەرىڭمەن بىزگە ۋادە ەتكەن ەدىڭ. سەنىڭ ۋادەڭ حاق. 
ۋا، اللا! وسى قاسيەتتى جەردە بارشا جاقسىلىعىڭدى بەرىپ، ءحالىمدى تولىقتاي تۇزەتۋىڭدى، سۇيىكتى قۇلدارىڭا بەرگەن يگىلىكتەردى ماعان دا بەرۋىڭدى جانە بارشا جاماندىق اتاۋلىدان قورعاۋىڭدى سۇرايمىن. مۇنى سەنەن باسقا ەشكىم جاساي المايدى. ەڭ جاقسىسىن سەن عانا جاسايسىڭ. ۋا، مەيىرىمدىلەردىڭ ەڭ مەيىرىمدىسى! 
ۋا، اللا! مەنى قۋىلعان شايتاننان، ءتۇرلى كەساپاتتان قورعاي كور. ماعان جەتەتىندەي رىزىق بەرىپ، بەرگەنىڭدى بەرەكەلى قىل. ۋا، راببىم! مەنى ساعان كەلگەندەردىڭ ەڭ ىزگىلەرىنەن قىل. ۋا، كۇللى الەمنىڭ راببى! ساعان قاۋىشقانعا دەيىن مەنى تۋرا جولدان اداستىرا كورمە.`
}
export const hairhut = {
  id: 'hairhut',
  audio_url: hairhut_audio,
  title: t`Шаш аларда оқылатын дұға`,
  title_ru: 'Дуа при обривании головы',
  title_tt: `شاش الاردا وقىلاتىن دۇعا`,
  prayer_text: `اَللّٰهُ اََكْبَرُ اَللّٰهُ اََكْبَرُ لَا اِلٰهَ اِلَّا اللّٰهُ وَاللّٰهُ اََكْبَرُ اَللّٰهُ اََكْبَرُ وَلِلّٰهِ الْحَمْدُ. اَلْحَمْدُ لِلّٰهِ عَلَى مَا هَدَانَا، وَالْحَمْدُ لِلّٰهِ عَلَى مَا اَنْعَمَ بِهِ عَلَيْنَا. اَللّٰهُمَّ هٰذِهِ نَاصِيَتِى فَتَقَبَّلْ مِنِّى وَاغْفِرْ لِى ذُنُوبِى. اَللّٰهُمَّ اغْفِرْ لِى ولِلْمُحَلِّقِينَ والمُقَصِّرِينَ يَا وَاسِعَ الْمَغْفِرَةِ آمِين`,
  translation_text: `Алла ұлы, Алла ұлы, Алладан басқа құдай жоқ. Алла ұлы, Алла ұлы, Барлық мадақ Аллаға тән. 
Бізді тура жолға салған Аллаға мадақ. Бізге нығметтерін жайған  Аллаға мадақ. Уа, Алла! Бүкіл болмысым Өзіңнің жолыңа құрбан болсын. Құлшылығымды қабыл қыл, күнәларымды кеше көр. Уа, кешірімі мол Раббым! Мені және қажылығын өтеп, шашын алдырған не қысқартқан барша мұсылмандарды кешіре көр! Әмин.`,
  translation_text_ru: `Аллах велик. Аллах велик. Нет бога, кроме Аллаха. Аллах велик. Аллах велик. Вся хвала принадлежит Аллаху.
Хвала Аллаху, который вывел нас на истинный путь. Хвала Аллаху, который одарил нас благами. О Аллах! Все, что у меня есть, принадлежит Тебе. Прими мой хадж. О Аллах, прости меня, и тех, кто сбривает волосы, и тех, кто укорачивает их, о Всепрощающий! Амин.`,
  translation_text_tt: `اللا ۇلى، اللا ۇلى، اللادان باسقا قۇداي جوق. اللا ۇلى، اللا ۇلى، بارلىق ماداق اللاعا ءتان. 
ءبىزدى تۋرا جولعا سالعان اللاعا ماداق. بىزگە نىعمەتتەرىن جايعان اللاعا ماداق. ۋا، اللا! بۇكىل بولمىسىم ءوزىڭنىڭ جولىڭا قۇربان بولسىن. قۇلشىلىعىمدى قابىل قىل، كۇنالارىمدى كەشە كور. ۋا، كەشىرىمى مول راببىم! مەنى جانە قاجىلىعىن وتەپ، شاشىن الدىرعان نە قىسقارتقان بارشا مۇسىلمانداردى كەشىرە كور! ءامين.`
}
export const qurban = {
  id: 'qurban',
  audio_url: qurban_audio,
  title: t`Құрбандық шаларда оқылатын дұға`,
  title_ru: 'Дуа во время жертвоприношения',
  title_tt: `قۇرباندىق شالاردا وقىلاتىن دۇعا`,
  prayer_text: `بِسْمِ اللّٰهِ، اَللّٰهُ اََكْبَرُ، اَللّٰهُمَّ مِنْكَ وَاِلَيْكَ وَتَقَبَّلْ مِنِّى، اِنِّى وَجَّهْتُ وَجْهِىَ لِلَّذِى فَطَرَ السَّمَاوَاتِ وَالْاَرْضَ حَنِيفًا وَمَا اَنَا مِنَ الْمُشْرِكِينَ. اِنَّ صَلَاتِى وَنُسُكِى وَمَحْيَاىَ وَمَمَاتِى لِلّٰهِ رَبِّ الْعَالَمِينَ. لَا شَرِيكَ لَهُ وَبِذٰلِكَ اُمِرْتُ وَاَنَا اَوَّلُ الْمُسْلِمِينَ`,
  translation_text: `Алланың атымен. Алла ұлы. Уа, Алла! (Осы құрбандықпен қоса мендегі барлық нәрсе) Сенен және (бұл құрбандықты) Сенің ризалығың үшін (шалдым), қабыл ала көр. 
Мен жүзімді күллі аспан әлемі мен жердің жалғыз Жаратушысына (Аллаға) қараттым. Мен Аллаға серік қосқандардан емеспін. 
Менің намазым да, өзге құлшылықтарым да, тіршілігім де, өлімім  де күллі әлемнің Раббысы бір Аллаға арналады. Оның серігі жоқ. Маған, берілген пәрмен, міне, осы. Мен мұсылмандардың алғашқысымын.`,
  translation_text_ru: `С именем Аллаха! Аллах велик! О Аллах! Все, что у меня есть, (включая это животное), от Тебя. Это (животное) - для Твоего довольства. Прими мое поклонение.Я обратился к истине и повернул свое лицо в сторону того, кто сотворил небо и землю. Я не придаю Аллаху сотоварищей.
Воистину, мой намаз и мое жертвоприношение (или поклонение), моя жизнь и моя смерть посвящены Аллаху, Господу миров, у Которого нет сотоварищей. Это мне велено, и я являюсь первым из мусульман.`,
  translation_text_tt: `اللانىڭ اتىمەن. اللا ۇلى. ۋا، اللا! (وسى قۇرباندىقپەن قوسا مەندەگى بارلىق نارسە) سەنەن جانە (بۇل قۇرباندىقتى) سەنىڭ ريزالىعىڭ ءۇشىن (شالدىم)، قابىل الا كور. 
مەن ءجۇزىمدى كۇللى اسپان الەمى مەن جەردىڭ جالعىز جاراتۋشىسى (اللاعا) قاراتتىم. مەن اللاعا سەرىك قوسقانداردان ەمەسپىن. 
مەنىڭ نامازىم دا، وزگە قۇلشىلىقتارىم دا، تىرشىلىگىم دە، ءولىمىم دە كۇللى الەمنىڭ راببىسى ءبىر اللاعا ارنالادى. ونىڭ سەرىگى جوق. ماعان، بەرىلگەن پارمەن، مىنە، وسى. مەن مۇسىلمانداردىڭ العاشقىسىمىن.`
}
export const travel_begin = {
  id: 'travel_begin',
  audio_url: travel_begin_audio,
  title: t`САПАРҒА ШЫҒАРДА ОҚЫЛАТЫН ДҰҒА`,
  title_ru: 'ДУА, ЧИТАЕМАЯ ПРИ ПОЕЗДКЕ',
  title_tt: `ساپارعا شىعاردا وقىلاتىن دۇعا`,
  prayer_text: `رَبِّ اَدْخِلْنِى مُدْخَلَ صِدْقٍ وَاَخْرِجْنِى مُخْرَجَ صِدْقٍ وَاجْعَلْ لِى مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا. اَللّٰهُمَّ بِكَ اَسْتَعِينُ، وَعَلَيْكَ اَتَوَكَّلُ، اَللّٰهُمَّ ذَلِّلْ لِى صُعُوبَةَ اَمْرِى، وَسَهِّلْ عَليَّ مَشَقَّةَ سَفَرِى، وَارْزُقْنِى مِنَ الْخَيْرِ اَكْثَرَ مِمَّا اَطْلُبُ، وَاصْرِفْ عَنِّى كُلَّ شَرٍّ، رَبِّ اشْرَحْ لِى صَدْرِى، وَيَسِّرْ لِى اَمْرِى، اَللّٰهُمَّ اِنِّى اَسْتَحْفِظُكَ واَسْتَوْدِعُكَ نَفْسِى وَدِينِى واَهْلِى واَقارِبى وكُلَّ مَا اَنْعَمْتَ عَلَىَّ وَعَليْهِمْ بِهِ مِنْ آخِرَةٍ وَدُنْيَا، فَاحْفَظْنَا اَجْمَعِينَ مِنْ كُلِّ سُوءٍ يا كَرِيمُ`,
  translation_text: `Уа, Раббым! Маған қандай да бір жерге аяқ басқанымда, хақ мақсатпен, шынайы ниетпен һәм Өзіңе шын берілген күйде кіруді, сондай-ақ ол жерден шығарда да хақ мақсатпен, шынайы ниетпен һәм Өзіңе шын берілген күйде шығуды нәсіп еткейсің. Әрі Өз тарапыңнан маған мықты қолдау көрсетіп, айқын дәлел бергейсің.
Уа, Алла! Тек Сенен ғана көмек сұраймын және тек Саған сенемін. Уа, Алла! Осы ісімді және сапарымды жеңілдете көр. Маған қалағанымнан мол жақсылығыңды бере көр. Әртүрлі жаманшылықты менен алыс қыл. Уа, Раббым! Көкірегімді кең қылып, иман нұрына, ілімге толтыра көр.
Уа, Алла! Өзімді, дінімді, отбасымды, туыстарымды және дүние мен ақыретте беретін нығметтеріңнің барлығын Саған аманат еттім. Уа, сыйы мол Раббым! Бізді әртүрлі жаманшылықтан сақтай көр.`,
  translation_text_ru: `О, Аллах! Когда я вступлю в какое-либо место, дай мне войти с истинной целью, истинным намерение и преданностью, и когда я уйду оттуда, дай мне уйти с истинной целью, истинным намерением и преданностью. О, Аллах! Прошу помощи, прибегаю к твоей защите и верю я только в Тебя. 
О, Аллах! Облегчи мое это путешествие и действие. Прошу, дай мне только хорошее в этой жизни. Огороди меня от разных неприятностей. О, Господи! Наполни мое сердце светом веры и знания. О, Господи! Я доверяю себя, свою семью, родственников и все благославления, которые ты даешь в этой и в той жизни только Тебе. О, мой Господь, Вседарующий! Защити и сохрани нас от разных неприятностей.`,
  translation_text_tt: `ۋا، راببىم! ماعان قانداي دا ءبىر جەرگە اياق باسقانىمدا، حاق ماقساتپەن، شىنايى نيەتپەن ءھام وزىڭە شىن بەرىلگەن كۇيدە كىرۋدى، سونداي-اق ول جەردەن شىعاردا دا حاق ماقساتپەن، شىنايى نيەتپەن ءھام وزىڭە شىن بەرىلگەن كۇيدە شىعۋدى ءناسىپ ەتكەيسىڭ. ءارى ءوز تاراپىڭنان ماعان مىقتى قولداۋ كورسەتىپ، ايقىن دالەل بەرگەيسىڭ.
ۋا، اللا! تەك سەنەن عانا كومەك سۇرايمىن جانە تەك ساعان سەنەمىن. ۋا، اللا! وسى ءىسىمدى جانە ساپارىمدى جەڭىلدەتە كور. ماعان قالاعانىمنان مول جاقسىلىعىڭدى بەرە كور. ءارتۇرلى جامانشىلىقتى مەنەن الىس قىل. ۋا، راببىم! كوكىرەگىمدى كەڭ قىلىپ، يمان نۇرىنا، ىلىمگە تولتىرا كور.
ۋا، اللا! ءوزىمدى، ءدىنىمدى، وتباسىمدى، تۋىستارىمدى جانە دۇنيە مەن اقىرەتتە بەرەتىن نىعمەتتەرىڭنىڭ بارلىعىن ساعان امانات ەتتىم. ۋا، سىيى مول راببىم! ءبىزدى ءارتۇرلى جامانشىلىقتان ساقتاي كور.`
}
export const when_entering_car = {
  id: 'when_entering_car',
  audio_url: when_entering_car_audio,
  title: t`КӨЛІККЕ МІНЕРДЕ ОҚЫЛАТЫН ДҰҒА`,
  title_ru: 'ДУА, КОТОРАЯ ЧИТАЕТСЯ ПРИ ПОСАДКЕ В ТРАНСПОРТ',
  title_tt: `كولىككە مىنەردە وقىلاتىن دۇعا`,
  prayer_text: `بِسْمِ اللّٰهِ مَجْرَاهَا وَمُرْسَاهَا اِنَّ رَبِّى لَغَفُورٌ رَحِيمٌ. سُبْحَانَ الَّذِى سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَاِنَّا اِلَى رَبِّنَا لَمُنْقَلِبُونَ. اَللّٰهُمَّ اِنَّا نَسْاَلُكَ فِى سَفَرِنَا هٰذَا الْبِرَّ وَالتَّقْوَى وَمِنَ الْعَمَلِ مَا تَرْضٰى. اَللّٰهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هٰذَا، وَاطْوِ عَنَّا بُعْدَهُ. اَللّٰهُمَّ اَنْتَ الصَّاحِبُ فِى السَّفَرِ وَالْخَلِيفَةُ فِى الاَهْلِ. اَللّٰهُمَّ اِنِّى اَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالاَهْلِ وَالْوَلَدِ`,
  translation_text: `Оның (көліктің) жүйткіп жүзуі де, тоқтауы да Алланың атымен. Раббым, расында да, өте кешірімді, ерекше мейірімді. Бізге осы мініс көлікті бағынышты еткен Алла мінсіз, кемшілік атаулыдан пәк. Әйтпесе, біздің оған шамамыз жетпес еді. 
Уа, Алла! Бұл сапарымызда Сенен жақсылық тілейміз, тақуалық пен ризашылығыңа сай амал сұраймыз. Уа, Алла! Сапарымызды оң қылып, барар жерімізге аман-есен жеткіз. Уа, Алла! Сен сапарда Иемізсің, отбасымызға Қамқоршысың. Уа, Алла! Жол азабы мен қайғы-мұңнан, қайтқанда мал-мүлкіміз зая болып, отбасымыз бен балаларымыздың қиыншылыққа түсуінен сақта.`,
  translation_text_ru: `Его быстаря езда останавливается во имя Аллаха. Господи, во истине очень прощающий и особо милосердный. Аллах, который покорил нас своей ездой, безупречна, несовершенна и чиста от всех недостатков. Иначе, мы не сможем себе этого позволить. 
О, Аллах! В этом путешествии мы желаем всего наилучшего, просим благочестия и благодарности. О, Аллах! Сделай наш визит благополучным и веди нас целым невредимым. О, Аллах! Ты наш Покровитель в пути, ты Хранитель нашей семьи. О, Аллах! Храни нас от дорожных страданий и печали, от того, что по возвращении не видеть страдании семьи и детей, убытка имущества и скота.`,
  translation_text_tt: `ونىڭ (كولىكتىڭ) جۇيتكىپ ءجۇزۋى دە، توقتاۋى دا اللانىڭ اتىمەن. راببىم، راسىندا دا، وتە كەشىرىمدى، ەرەكشە مەيىرىمدى. بىزگە وسى ءمىنىس كولىكتى باعىنىشتى ەتكەن اللا ءمىنسىز، كەمشىلىك اتاۋلىدان پاك. ايتپەسە، ءبىزدىڭ وعان شامامىز جەتپەس ەدى.
ۋا، اللا! بۇل ساپارىمىزدا سەنەن جاقسىلىق تىلەيمىز، تاقۋالىق پەن ريزاشىلىعىڭا ساي امال سۇرايمىز. ۋا، اللا! ساپارىمىزدى وڭ قىلىپ، بارار جەرىمىزگە امان-ەسەن جەتكىز. ۋا، اللا! سەن ساپاردا يەمىزسىڭ، وتباسىمىزعا قامقورشىسىڭ. ۋا، اللا! جول ازابى مەن قايعى-مۇڭنان، قايتقاندا مال-مۇلكىمىز زايا بولىپ، وتباسىمىز بەن بالالارىمىزدىڭ قيىنشىلىققا تۇسكەنىن كورۋدەن ساقتا.ۋا، اللا! تەك سەنەن عانا كومەك سۇرايمىن جانە تەك ساعان سەنەمىن. ۋا، اللا! وسى ءىسىمدى جانە ساپارىمدى جەڭىلدەتە كور. ماعان قالاعانىمنان مول جاقسىلىعىڭدى بەرە كور. ءارتۇرلى جامانشىلىقتى مەنەن الىس قىل. ۋا، راببىم! كوكىرەگىمدى كەڭ قىلىپ، يمان نۇرىنا، ىلىمگە تولتىرا كور.
ۋا، اللا! ءوزىمدى، ءدىنىمدى، وتباسىمدى، تۋىستارىمدى جانە دۇنيە مەن اقىرەتتە بەرەتىن نىعمەتتەرىڭنىڭ بارلىعىن ساعان امانات ەتتىم. ۋا، سىيى مول راببىم! ءبىزدى ءارتۇرلى جامانشىلىقتان ساقتاي كور.`
}

export const throwing_stone_shaitan = {
  id: 'throwing_stone_shaitan',
  audio_url: throwing_stone_shaitan_audio,
  title: t`Шайтанға тас лақтырарда оқылатын дұға`,
  title_ru: 'Дуа при побивании шайтана камнями',
  title_tt: `شايتانعا تاس لاقتىراردا وقىلاتىن دۇعا`,
  prayer_text: `بِسْمِ اللّٰهِ، اَللّٰهُ اََكْبَرُ، رَغْمًا لِلشَّيْطَانِ وَحِزْبِهِ، اَللّٰهُمَّ اجْعَلْهُ حَجًّا مَبْرُوْرًا وَذَنْبًا مَغْفُوْرًا وَسَعْيًا مَشْكُوْرًا وَعَمَلًا صَالِحًا مَقْبُوْلًا وَتِجَارَةً لَنْ تَبُوْرَ. اَللّٰهُ اَكْبَرُ لَا اِلٰهَ اِلَّا اللّٰهُ وَاللّٰهُ اََكْبَرُ اَللّٰهُ اَكْبَرُ وَلِلّٰهِ الْحَمْدُ.`,
  translation_text: `Алланың атымен. Алла  ұлы. Шайтан мен оның әскерлерін қарғыс ұрсын! Уа, Алла! Қажылығымызды қабыл ал. Күнәларымызды кешір. Еңбегімізді жандыр. Игі істермізді қабыл алып, саудамызды зиянсыз қыл.
Алла ұлы, Алла ұлы, Алладан басқа құдай жоқ. Алла ұлы, Алла ұлы, Барлық мадақ Аллаға тән.`,
  translation_text_ru: `С именем Аллаха! Аллах велик. Да будет проклят шайтан и его приспешники . О Аллах! Прими наш хадж. Прости наши грехи. Вознагради наши старания. Помоги нам совершать благие дела и прими их. Сделай нашу торговлю прибыльной. Аллах велик. Аллах велик. Нет бога, кроме Аллаха. Аллах велик. Вся хвала принадлежит Аллаху.`,
  translation_text_tt: `اللانىڭ اتىمەن. اللا ۇلى. شايتان مەن ونىڭ اسكەرلەرىن قارعىس ۇرسىن! ۋا، اللا! قاجىلىعىمىزدى قابىل ال. كۇنالارىمىزدى كەشىر. ەڭبەگىمىزدى جاندىر. يگى ىستەرمىزدى قابىل الىپ، ساۋدامىزدى زيانسىز قىل.
اللا ۇلى، اللا ۇلى، اللادان باسقا قۇداي جوق. اللا ۇلى، اللا ۇلى، بارلىق ماداق اللاعا ءتان.`
}
