import madina_enter_audio from '../../assets/madina_enter.mp3'
import prophet_salaam_audio from '../../assets/prophet_salaam.mp3'
import abubakr_salaam_audio from '../../assets/abubakr_salaam.mp3'
import umar_salaam_audio from '../../assets/umar_salaam.mp3'
import baqi_salaam_audio from '../../assets/baqi_salaam.mp3'
import usman_salaam_audio from '../../assets/usman_salaam.mp3'
import uhud_warriors_salaam_audio from '../../assets/uhud_warriors_salaam.mp3'
import prophet_bye_audio from '../../assets/prophet_bye.mp3'

export const madina_enter = {
  id: 'madina_enter',
  audio_url: madina_enter_audio,
  title: 'Мәдина мүнәууараға кірерде оқылатын дұға',
  title_ru: 'Дуа при входе в Медину',
  title_tt: `ءمادينا مۇناۋۋاراعا كىرەردە وقىلاتىن دۇعا`,
  prayer_text: `اَللّٰهُمَّ‭ ‬هٰذَا‭ ‬حَرَمُ‭ ‬نَبِيِّكَ‭ ‬وَمَهْبِطُ‭ ‬وَحْيِكَ‭ ‬فَامْنُنْ‭ ‬عَلَىَّ‭ ‬بِالدُّخُولِ‭ ‬فِيهِ‭ ‬وَاجْعَلْهُ‭ ‬وِقَايَةً‭ ‬لِى‭ ‬مِنَ‭ ‬النَّارِ‭ ‬واََمَاناً‭ ‬مِنَ‭ ‬الْعَذابِ‭ ‬وَاجْعَلْنِى‭ ‬مِنَ‭ ‬الْفَائِزِينَ‭ ‬بِشِفَاعَةِ‭ ‬الْمُصْطَفَى‭ ‬يَوْمَ‭ ‬الْمَآبِ‭.‬`,
  translation_text: `Уа, Алла! Бұл жер Сенің Пайғамбарыңның Харамы. Сенен уахи түскен қасиетті қала. Осы көркем қаланы мен үшін тозақтан қорғанатын пана, азабыңа қарсы қалқан қыла көр.
Уа, Алла! Рахмет есіктеріңді айқара аша көр. Расулыңды зиярат етуімді нәсіп еткейсің. Ізгі құлдарыңа берген жақсылықтарыңды маған бұйыртып, Пайғамбарымыздың (с.а.у.) шапағатына жеткізгейсің. `,
  translation_text_ru: `О Аллах! Это - харам (заповедное место) Твоего пророка. Это благословенный город, где было ниспослано Твое откровение. Сделай этот город моей защитой от Ада и его мучений.
О Аллах! Открой мне врата милости. Позволь мне навестить Твоего Посланника. Даруй мне блага, которыми Ты одарил Своих праведных рабов. Сделай меня достойным заступничества Пророка.`,
  translation_text_tt: `ۋا، اللا! بۇل جەر سەنىڭ پايعامبارىڭنىڭ حارامى. سەنەن ۋاحي تۇسكەن قاسيەتتى قالا. وسى كوركەم قالانى مەن ءۇشىن توزاقتان قورعاناتىن پانا، ازابىڭا قارسى قالقان قىلا كور.
ۋا، اللا! راحمەت ەسىكتەرىڭدى ايقارا اشا كور. راسۋلىڭدى زيارات ەتۋىمدى ءناسىپ ەتكەيسىڭ. ىزگى قۇلدارىڭا بەرگەن جاقسىلىقتارىڭدى ماعان بۇيىرتىپ، پايعامبارىمىزدىڭ (س.ا.ۋ.) شاپاعاتىنا جەتكىزگەيسىڭ.`
}
export const prophet_salaam = {
  id: 'prophet_salaam',
  audio_url: prophet_salaam_audio,
  title: 'Пайғамбарымызға (с.а.у.) сәлем беру',
  title_ru: 'Приветствие Пророку (с.а.в.)',
  title_tt: `پايعامبارىمىزعا (س.ا.ۋ.) سالەم بەرۋ`,
  prayer_text: `اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬اَيُّهَا‭ ‬النَّبِىُّ‭ ‬وَرَحْمَةُ‭ ‬اللهِ‭ ‬وَبَرَكَاتُهُ
اَلصَّلَاةُ‭ ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬رَسُولَ‭ ‬اللهِ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬حَبِيبَ‭ ‬اللهِ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬خَلِيلَ‭ ‬اللهِ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬نَبِىَّ‭ ‬اللهِ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬صَفِىَّ‭ ‬اللهِ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬خَيْرَ‭ ‬خَلْقِ‭ ‬اللهِ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬نُورَ‭ ‬عَرْشِ‭ ‬اللهِ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬اَمِينَ‭ ‬وَحْىِ‭ ‬اللهِ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنِ‭ ‬اخْتَارَهُ‭ ‬اللهُ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنِ‭ ‬اَرْسَلَهُ‭ ‬اللهُ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنْ‭ ‬زَيَّنَهُ‭ ‬اللهُ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنْ‭ ‬شَرَّفَهُ‭ ‬اللهُ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنْ‭ ‬كَرَّمَهُ‭ ‬اللهُ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنْ‭ ‬عَظَّمَهُ‭ ‬اللهُ‭ ‬،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنْ‭ ‬عَلَّمَهُ‭ ‬اللهُ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬سَيِّدَ‭ ‬الْمُرْسَلِينَ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬اِمَامَ‭ ‬الْمُتَّقِينَ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬خَاتَمَ‭ ‬النَّبِيِّينَ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬شَفِيعَ‭ ‬الْمُذْنِبِينَ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬رَحْمَةً‭ ‬لِلْعَالَمِينَ،
اَلصَّلَاةُ‭  ‬وَالسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬رَسُولَ‭ ‬رَبِّ‭ ‬الْعَالَمِينَ،
صَلَوَاتُ‭ ‬اللهِ‭ ‬وَمَلَائِكَتِهِ‭ ‬وَاَنْبِيَائِهِ‭ ‬وَرُسُلِهِ‭ ‬وَحَمَلَةِ‭ ‬عَرْشِهِ‭ ‬وَجَمِيعِ‭ ‬خَلْقِهِ‭ ‬عَلَى‭ ‬سَيِّدِنَا‭ ‬وَنَبِيِّنَا‭ ‬مُحَمَّدٍ‭ ‬وَعَلَى‭ ‬اَلِهِ‭ ‬وَاَصْحَابِهِ‭ ‬اَجْمَعِينَ‭.
`,
  translation_text: `Сәлем саған, уа, Пайғамбар! Саған Алланың рахметі мен берекесі жаусын!
Салауат пен салем саған, уа, Алланың Расулы! 
Салауат пен салем саған, уа, Алланың сүйіктісі!
Салауат пен салем саған, уа, Алланың досы!
Салауат пен салем саған, уа, Алланың Нәбиі!
Салауат пен салем саған, уа, Алланың таңдаулысы!
Салауат пен салем саған, уа, жаратылғандардың ең хайырлысы! 
Салауат пен салем саған, уа, Алла Аршының нұры!
Салауат пен салем саған, уа, Алла уахиын аманат еткені!
Салауат пен салем саған, уа, Алланың таңдаулысы!
Салауат пен салем саған, уа, Алланың жібергені!
Салауат пен салем саған, уа, Алланың әсемдегені!
Салауат пен салем саған, уа, Алланың абыройлысы!
Салауат пен салем саған, уа, Алланың жомарты!
Салауат пен салем саған, уа, Алланың мәртебелі!
Салауат пен салем саған, уа, Алланың ғұламасы!
Салауат пен салем саған, уа, пайғамбарлар мырзасы!
Салауат пен салем саған, уа, тақуалардың көсемі!
Салауат пен салем саған, уа, пайғамбарлар соңғысы!
Салауат пен салем саған, уа, күнәһарлар шапағатшысы!
Салауат пен салем саған, уа, күллі әлемнің рақымы!
Салауат пен салем саған, уа, күллі әлемнің Раббысының Елшісі!
Алланың, періштелерінің, нәбилерінің, расулдерінің, Аршты көтеріп тұрғандардың, бүкіл жаратылыстың салауаты біздің мырзамыз, Пайғамбарымыз Мұхаммед аләйһиссәләмға және оның жанұясы мен сахабаларының барлығына болсын.
`,
  translation_text_ru: `О Пророк! Мир тебе, милость Аллаха и Его благословение!
О Посланник Аллаха! Мир тебе и благословение.
О любимый раб Аллаха! Мир тебе и благословение.
О друг Аллаха! Мир тебе и благословение.
О Пророк Аллаха! Мир тебе и благословение.
О избранный! Мир тебе и благословение.
О лучший из людей! Мир тебе и благословение.
О свет Арша! Мир тебе и благословение
О тот, кому он ниспослал Свое откровение! Мир тебе и благословение.
О тот, кого избрал Аллах! Мир тебе и благословение.
О тот, кого Аллах украсил! Мир тебе и благословение.
О тот, кого Аллах возвысил! Мир тебе и благословение.
О тот, кому Аллах даровал щедрость! Мир тебе и благословение
О тот, кому Аллах даровал величие! Мир тебе и благословение
О тот, кому Аллах даровал знание! Мир тебе и благословение.
О глава пророков! Мир тебе и благословение.
О предводитель богобоязненных! Мир тебе и благословение.
О последний из пророков! Мир тебе и благословение.
О заступник грешников! Мир тебе и благословение.
О посланный как милость для миров! Мир тебе и благословение.
О посланник Господа миров! Мир тебе и благословение.
Да пребудет с Мухаммадом Алейхиссалям, его семейством и сахабами благословение Аллаха, ангелов, пророков, посланников, несущих Трон, и всех созданий.
`,
  translation_text_tt: `سالەم ساعان، ۋا، پايعامبار! ساعان اللانىڭ راحمەتى مەن بەرەكەسى جاۋسىن!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ راسۋلى! 
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ سۇيىكتىسى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ دوسى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ ءنابيى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ تاڭداۋلىسى!
سالاۋات پەن سالەم ساعان، ۋا، جاراتىلعانداردىڭ ەڭ حايىرلىسى! 
سالاۋات پەن سالەم ساعان، ۋا، اللا ارشىنىڭ نۇرى!
سالاۋات پەن سالەم ساعان، ۋا، اللا ۋاحيىن امانات ەتكەنى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ تاڭداۋلىسى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ جىبەرگەنى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ اسەمدەگەنى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ ابىرويلىسى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ جومارتى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ مارتەبەلى!
سالاۋات پەن سالەم ساعان، ۋا، اللانىڭ عۇلاماسى!
سالاۋات پەن سالەم ساعان، ۋا، پايعامبارلار مىرزاسى!
سالاۋات پەن سالەم ساعان، ۋا، تاقۋالاردىڭ كوسەمى!
سالاۋات پەن سالەم ساعان، ۋا، پايعامبارلار سوڭعىسى!
سالاۋات پەن سالەم ساعان، ۋا، كۇناھارلار شاپاعاتشىسى!
سالاۋات پەن سالەم ساعان، ۋا، كۇللى الەمنىڭ راقىمى!
سالاۋات پەن سالەم ساعان، ۋا، كۇللى الەمنىڭ راببىسىنىڭ ەلشىسى!
اللانىڭ، پەرىشتەلەرىنىڭ، نابيلەرىنىڭ، راسۋلدەرىنىڭ، ارشتى كوتەرىپ تۇرعانداردىڭ، بۇكىل جاراتىلىستىڭ سالاۋاتى ءبىزدىڭ مىرزامىز، پايعامبارىمىز مۇحاممەد الايھيسسالامعا جانە ونىڭ جانۇياسى مەن ساحابالارىنىڭ بارلىعىنا بولسىن.
`
}
export const abubakr_salaam = {
  id: 'abubakr_salaam',
  audio_url: abubakr_salaam_audio,
  title: 'Әбу Бәкірге  (р.а.) сәлем беру',
  title_ru: 'Приветствие Абу Бакра  (р.а.)',
  title_tt: `ءابۋ باكىرگە (ر.ا.) سالەم بەرۋ`,
  prayer_text: `اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬اَبَا‭ ‬بَكْرٍ‭ ‬الصِّدِّيقَ‭ ‬رَضِىَ‭ ‬اللهُ‭ ‬عَنْهُ
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬خَلِيفَةَ‭ ‬رَسُولِ‭ ‬اللهِ
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬صَاحِبَ‭ ‬رَسُولِ‭ ‬اللهِ
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬اَمِيرَ‭ ‬الْمُؤْمِنِينَ
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬يَارَ‭ ‬غَارِ‭ ‬رَسُولِ‭ ‬اللهِ‭.
`,
  translation_text: `Сәлем саған, уа, Әбу Бәкір Сыддық (р.а)!
Сәлем саған, уа, Расулулланың халифасы!
Сәлем саған, уа, Расулулланың досы! 
Сәлем саған, уа, мұсылмандардың әміршісі!
Сәлем саған, уа, Расулулланың үңгірдегі досы!
`,
  translation_text_ru: `Мир тебе, о Абу Бакр ас-Сыддык! (радиялЛаху анх)
Мир тебе, о халиф Посланника Аллаха!
Мир тебе, о друг Посланник Аллаха!
Мир тебе, о повелитель правоверных!
Мир тебе, о спутник Посланника Аллаха в пещере!
`,
  translation_text_tt: `سالەم ساعان، ۋا، ءابۋ باكىر سىددىق (ر.ا)!
سالەم ساعان، ۋا، راسۋلۋللانىڭ حاليفاسى!
سالەم ساعان، ۋا، راسۋلۋللانىڭ دوسى! 
سالەم ساعان، ۋا، مۇسىلمانداردىڭ ءامىرشىسى!
سالەم ساعان، ۋا، راسۋلۋللانىڭ ۇڭگىردەگى دوسى!
`
}
export const umar_salaam = {
  id: 'umar_salaam',
  audio_url: umar_salaam_audio,
  title: 'Омарға  (р.а.) сәлем беру',
  title_ru: 'Приветствие Умара (р.а.)',
  title_tt: `ومارعا (ر.ا.) سالەم بەرۋ`,
  prayer_text: `اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬عُمَرُ‭ ‬الْفَارُوقُ‭ ‬رَضِىَ‭ ‬اللهُ‭ ‬عَنْهُ
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬خَلِيفَةَ‭ ‬رَسُولِ‭ ‬اللهِ
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنْ‭ ‬اَظْهَرَ‭ ‬اللهُ‭ ‬بِهِ‭ ‬الدِّينَ
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬اَمِيرَ‭ ‬الْمُؤْمِنِينَ
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مَنْ‭ ‬اَعَزَّ‭ ‬اللهُ‭ ‬بِهِ‭ ‬الدِّين‭.‬
`,
  translation_text: `Сәлем саған, уа, Омар ул-Фаруқ!
Сәлем саған, уа, мұсылмандардың әміршісі!
Сәлем саған, уа, Алла дінін өзіңмен жария қылған жан!
Сәлем саған, уа, Расулулланың халифасы!
Сәлем саған, уа, Расулулланың досы!
Сәлем саған, уа, Алла дінін өзіңмен үстем еткен жан!
`,
  translation_text_ru: `Мир тебе, о Умар аль-Фарук! (радияЛлаху анх). Мир тебе, о повелитель правоверных! Мир тебе о тот, через кого Аллах проявил Свою религию! Мир тебе, о халиф Посланника Аллаха! Мир тебе, о друг Посланника Аллаха! Мир тебе, о тот, который возвысил религию Аллаха!
`,
  translation_text_tt: `سالەم ساعان، ۋا، ومار ۋل-فارۋق!
سالەم ساعان، ۋا، مۇسىلمانداردىڭ ءامىرشىسى!
سالەم ساعان، ۋا، اللا ءدىنىن وزىڭمەن جاريا قىلعان جان!
سالەم ساعان، ۋا، راسۋلۋللانىڭ حاليفاسى!
سالەم ساعان، ۋا، راسۋلۋللانىڭ دوسى!
سالەم ساعان، ۋا، اللا ءدىنىن وزىڭمەن ۇستەم ەتكەن جان!`
}

// BUG WITH TEXT
export const baqi_salaam = {
  id: 'baqi_salaam',
  audio_url: baqi_salaam_audio,
  title: 'Бақи жұртына сәлем беру',
  title_ru: 'Дуа на кладбище Баки',
  title_tt: `باقي جۇرتىنا سالەم بەرۋ`,
  prayer_text: `اَلسَّلَامُ عَلَيْكُمْ يَا دَارَ قَوْمٍ مُؤْمِنِينَ، واِنَّا اِنْ شَاءَ اللهُ بِكُمْ لاحِقُونَ،
اَلسَّلَامُ عَلَيْكُمْ يَا اَهْلَ الْبَقِيعِ،
اَلسَّلَامُ عَلَيْكُمْ يَا اَصْحَابَ النَّبِىِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،
اَلسَّلَامُ عَلَيْكُمْ يَا اَهْلَ بَيْتِ مُحَمَّدٍ صَلَّى اللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ،
اَلسَّلَامُ عَلَيْكُنَّ يَا اَزْوَاجَ النَّبِىِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،
اَلسَّلَامُ عَلَيْكُنَّ  يَا اُمَّهَاتِ الْمُؤْمِنِينَ،
اَللّٰهُمَّ اغْفِرْ لِاََهْلِ الْبَقِيعِ الْغَرْقَدِ، 
اَللّٰهُمَّ اغْفِرْ لَنَا وَلَهُمْ اَجْمَعِينَ.`,
  translation_text: `Сәлем сендерге, уа, мұсылмандар өлкесі!
Алланың қалауыман біз де сендермен қауышатын боламыз.
Сәлем сендерге, уа, Бақи жұрты!
Сәлем сендерге, уа, Пайғамбар сахабалары!
Сәлем сендерге, уа, Расулулланың жанұясы!
Сәлем сендерге, уа, Пайғамбар жұбайлары!
Сәлем сендерге, уа, мұсылмандардың аналары!
Уа, Алла! Бақи жұртын, біздерді, баршамызды кешіре көр!
`,
  translation_text_ru: `Мир вам, о обитатели могил из верующих,
Если пожелает Аллах, мы последуем за вами.
Мир вам, о покоящиеся на кладбище Баки,
Мир вам, о сахабы пророка, о ахли байт,
Мир вам, о жены Посланника Аллаха,
Мир вам, о матери правоверных
О Аллах, прости обитателей могил Баки, нас, и всех верующих.
`,
  translation_text_tt: `سالەم سەندەرگە، ۋا، مۇسىلماندار ولكەسى!
اللانىڭ قالاۋىمان ءبىز دە سەندەرمەن قاۋىشاتىن بولامىز.
سالەم سەندەرگە، ۋا، باقي جۇرتى!
سالەم سەندەرگە، ۋا، پايعامبار ساحابالارى!
سالەم سەندەرگە، ۋا، راسۋلۋللانىڭ جانۇياسى!
سالەم سەندەرگە، ۋا، پايعامبار جۇبايلارى!
سالەم سەندەرگە، ۋا، مۇسىلمانداردىڭ انالارى!
ۋا، اللا! باقي جۇرتىن، بىزدەردى، بارشامىزدى كەشىرە كور!
`
}
export const usman_salaam = {
  id: 'usman_salaam',
  audio_url: usman_salaam_audio,
  title: 'Османға  (р.а.) сәлем беру',
  title_ru: 'Приветствие Усмана (р.а.)',
  title_tt: `وسمانعا (ر.ا.) سالەم بەرۋ`,
  prayer_text: `اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬عُثْمَانُ‭ ‬بْنِ‭ ‬عَفَّانَ‭ ‬رَضِىَ‭ ‬اللهُ‭ ‬عَنْهُ،
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬ذِى‭ ‬النُّورَيْنِ،
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬صَاحِبَ‭ ‬رَسُولِ‭ ‬اللهِ،
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬صَاحِبَ‭ ‬الْحَيَاءِ،
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬خَلِيفَةَ‭ ‬رَسُولِ‭ ‬اللهِ،
اَلسَّلَامُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬اَمِيرَ‭ ‬الْمُؤْمِنِينَ‭.‬
`,
  translation_text: `Сәлем саған, уа, Осман ибн Аффан (р.а.)!
Сәлем саған, уа, қос нұрдың иесі!
Сәлем саған, уа, Расулулланың досы!
Сәлем саған, уа, ар-ұяттың иесі! 
Сәлем саған, уа, расулулланың халифасы!
Сәлем саған, уа, мұсылмандардың әміршісі!
`,
  translation_text_ru: `Мир тебе, о Усман ибн Аффан! (радияЛлаху анх)
Мир тебе, о обладатель двух сияний!
Мир тебе, о друг Посланника Аллаха!
Мир тебе. о обладатель скромности!
Мир тебе, о Халиф Посланника Аллаха!
Мир тебе, о повелитель правоверных!
`,
  translation_text_tt: `سالەم ساعان، ۋا، وسمان يبن اففان (ر.ا.)!
سالەم ساعان، ۋا، قوس نۇردىڭ يەسى!
سالەم ساعان، ۋا، راسۋلۋللانىڭ دوسى!
سالەم ساعان، ۋا، ار-ۇياتتىڭ يەسى! 
سالەم ساعان، ۋا، راسۋلۋللانىڭ حاليفاسى!
سالەم ساعان، ۋا، مۇسىلمانداردىڭ ءامىرشىسى!`
}

export const uhud_warriors_salaam = {
  id: 'uhud_warriors_salaam',
  audio_url: uhud_warriors_salaam_audio,
  title: 'Ұхұд шейіттеріне сәлем беру',
  title_ru: 'Приветствие павшим в битве при Ухуде',
  title_tt: `ۇحۇد شەيىتتەرىنە سالەم بەرۋ`,
  prayer_text: `اَلسَّلاَمُ‭ ‬عَلَيْكَ‭ ‬يَاحَمْزَةُ‭ ‬رَضِىَ‭ ‬اللهُ‭ ‬عَنْهُ،
اَلسَّلاَمُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬عَمَّ‭ ‬رَسُولِ‭ ‬اللهِ،‭ ‬
اَلسَّلاَمُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬سَيِّدَ‭ ‬الشُّهَدَاءِ،‭ ‬
اَلسَّلاَمُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬اََسَدَ‭ ‬اللهِ،‭ ‬
اَلسَّلاَمُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬اََسَدَ‭ ‬رَسُولِ‭ ‬اللهِ،
اَلسَّلاَمُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬عَبْدَ‭ ‬اللهِ‭ ‬بْنِ‭ ‬جَحْشٍ‭ ‬رَضِىَ‭ ‬اللهُ‭ ‬عَنْهُ،
اَلسَّلاَمُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬مُصْعَبُ‭ ‬بْنُ‭ ‬عُمَيْرَ‭ ‬رَضِىَ‭ ‬اللهُ‭ ‬عَنْهُ،
اَلسَّلاَمُ‭ ‬عَلَيْكَ‭ ‬يَا‭ ‬شَمَّاسُ‭ ‬بْنُ‭ ‬عُثْمَانَ‭ ‬رَضِىَ‭ ‬اللهُ‭ ‬عَنْهُ،
اَلسَّلاَمُ‭ ‬عَلَيْكَمْ‭ ‬يَا‭ ‬شُّهَدَاءَ‭ ‬اَُحُدٍ،‭ ‬
اَلسَّلاَمُ‭ ‬عَلَيْكَمْ‭ ‬يَا‭ ‬اََصْحَابَ‭ ‬النَّبِىِّ‭ ‬صَلَّى‭ ‬اللهُ‭ ‬عَلَيْهِ‭ ‬وَسَلَّمَ،
اَلسَّلاَمُ‭ ‬عَلَيْكُمْ‭ ‬بِمَا‭ ‬صَبَرْتُمْ‭ ‬فَنِعْمَ‭ ‬عُقْبَى‭ ‬الدَّارِ،‭ ‬
اَللّٰهُمَّّ‭ ‬ارْضَ‭ ‬عَنْهُمْ‭ ‬وَارْفَعْ‭ ‬دَرَجَتَهُمْ‭ ‬وَاََكْرِمْ‭ ‬مَقَامَهُمْ‭ ‬وَاََجْزِلْ‭ ‬ثَوَابَهُمْ‭ ‬بِفَضْلِكَ‭ ‬وَكَرَمِكَ‭ ‬يَااََكْرَمَ‭ ‬اْلاََكْرَمِينَ‭.‬
`,
  translation_text: `әлем саған, уа, Хамза (р.а.)! 
Сәлем саған, уа, Расулуланың көкесі! 
Сәлем саған, уа, шейттердің мырзасы!
Сәлем саған, уа, Алланың арыстаны!
Сәлем саған, уа, Расулулланың арыстаны!
Сәлем саған, уа, Абдулла ибн Жахш (р.а.)!
Сәлем саған, уа, Мусғаб ибн Умәйр (р.а.)!
Сәлем саған, уа, Шәммас иин Осман (р.а.)!
Сәлем сендерге, уа, Ұхұд шейіттері!
Сәлем сендерге, уа, Пайғамбар сахабалары!
Сәлем сендерге, сабырлы, қайратты болғандар. Алла сендерге жұмағында қандай күшті нығметтер дайындаған десеңші!  
`,
  translation_text_ru: `Мир тебе, о Хамза радияллаху анх. Мир тебе, о дядя Посланника Аллаха. Мир тебе, о господин павших за веру. Мир тебе, о лев Аллаха. Мир тебе, о лев Посланника Аллаха.
Мир тебе, о Абдуллах ибн Джахш.
Мир тебе, о Мусаб ибн Умайр.
Мир тебе, о Шаммаса ибн Усман.
Мир вам, о павшие при Ухуде! Мир вам, сахабы Пророка, мир вам, прекрасны райские блага, которые Аллах приготовил вам за ваше терпение и упорство. 
`,
  translation_text_tt: `سالەم ساعان، ۋا، حامزا (ر.ا.)! 
سالەم ساعان، ۋا، راسۋلۋلانىڭ كوكەسى! 
سالەم ساعان، ۋا، شەيتتەردىڭ مىرزاسى!
سالەم ساعان، ۋا، اللانىڭ ارىستانى!
سالەم ساعان، ۋا، راسۋلۋللانىڭ ارىستانى!
سالەم ساعان، ۋا، ابدۋللا يبن جاحش (ر.ا.)!
سالەم ساعان، ۋا، مۋسعاب يبن ءۋماير (ر.ا.)!
سالەم ساعان، ۋا، ءشامماس يين وسمان (ر.ا.)!
سالەم سەندەرگە، ۋا، ۇحۇد شەيىتتەرى!
سالەم سەندەرگە، ۋا، پايعامبار ساحابالارى!
سالەم سەندەرگە، سابىرلى، قايراتتى بولعاندار. اللا سەندەرگە جۇماعىندا قانداي كۇشتى نىعمەتتەر دايىنداعان دەسەڭشى!`
}
export const prophet_bye = {
  id: 'prophet_bye',
  audio_url: prophet_bye_audio,
  title: 'Пайғамбарымызбен (с.а.у.) қоштасардағы дұға',
  title_ru: 'Дуа при прощании с Пророком (с.а.в.)',
  title_tt: `پايعامبارىمىزبەن (س.ا.ۋ.) قوشتاسارداعى دۇعا`,
  prayer_text: `اَللّٰهُمَّ‭ ‬اجْعَلْنَا‭ ‬نُحِبُّكَ‭ ‬وَنُحِبُّ‭ ‬نَبِيُّكَ‭ ‬وَنُحِبُّ‭ ‬مَلائِكَتَكَ‭ ‬وَاََنْبِيَاءَكَ‭ ‬وَرُسَلَكَ‭ ‬وَنُحِبُّ‭ ‬عِبَادَكَ‭ ‬الصَّالِحِينَ،‭ ‬اَللّٰهُمَّ‭ ‬حَبِّبْنَا‭ ‬اِلَيْكَ‭ ‬وَاِلَى‭ ‬نَبِيِّكَ‭ ‬وَاِلَى‭ ‬مَلائِكَتِكَ‭ ‬وَاََنْبِيَاءَكَ‭ ‬وَرُسَلَكَ‭ ‬وَاِلَى‭ ‬عِبَادَكَ‭ ‬الصَّالِحِينَ،‭ ‬اَللّٰهُمَّ‭ ‬يَسِّرْنَا‭ ‬لِلْيُسْرَى‭ ‬وَجَنِّبْنَا‭ ‬الْعُسْرَى‭ ‬وَاغْفِرْ‭ ‬لَنَا‭ ‬فِى‭ ‬الآخِرَةِ‭ ‬وَالْاَُولَى‭ ‬وَاجْعَلْنَا‭ ‬مِنْ‭ ‬اََئِمَّةِ‭ ‬الْمُتَّقِينَ‭. ‬اَللّٰهُمَّ‭ ‬لَا‭ ‬تَجْعَلْ‭ ‬هٰذَا‭ ‬آخِرَ‭ ‬الْعَهْدِ‭ ‬بِحَرَمِ‭ ‬رَسُولِكَ‭ ‬وَيَسِّرْ‭ ‬لِى‭ ‬الْعَوْدَ‭ ‬اِلَى‭ ‬الْحَرَمَيْنِ‭ ‬سَبِيلًا‭ ‬سَهْلةً‭ ‬بِمَنِّكَ‭ ‬وَفَضْلِكَ،‭ ‬وَارْزُقْنَا‭ ‬الْعَفْوَ‭ ‬وَالْعَافِيَةَ‭ ‬فِى‭ ‬الدُّنْيَا‭ ‬وَالْآخِرَةِ‭ ‬وَرُدَّنَا‭ ‬سَالِمِينَ‭ ‬غَانِمِينَ‭ ‬اِلَى‭ ‬اََوْطَانِنَا‭ ‬آمِنِينَ،‭ ‬اَللّٰهُمَّّ‭ ‬لَكَ‭ ‬اََسْلَمْتُ‭ ‬وَعَلَيْكَ‭ ‬تَوَكَّلْتُ‭ ‬وَبِكَ‭ ‬آمَنْتُ‭ ‬وَاِلَيْكَ‭ ‬حَاكَمْتُ‭ ‬فَاغْفِرْ‭ ‬لِى‭ ‬مَا‭ ‬قَدَّمْتُ‭ ‬وَاََخَّرْتُ‭ ‬وَمَا‭ ‬اََسْرَرْتُ‭ ‬وَمَا‭ ‬اََعْلَنْتُ‭ ‬اََنْتَ‭ ‬رَبِّى‭ ‬لَا‭ ‬اِلَهَ‭ ‬اِلَّا‭ ‬اََنْتَ،‭ ‬رَبَّنَا‭ ‬اغْفِرْ‭ ‬لَنَا‭ ‬وَلِاِخْوَانِنَا‭ ‬الَّذِينَ‭ ‬سَبَقُونَا‭ ‬بِالْاِيمَانِ‭ ‬وَلَا‭ ‬تَجْعَلْ‭ ‬فِي‭ ‬قُلُوبِنَا‭ ‬غِلًّا‭ ‬لِلَّذِينَ‭ ‬آمَنُوا‭ ‬رَبَّنَا‭ ‬اِنَّكَ‭ ‬رَءُوفٌ‭ ‬رَحِيمٌ،‭ ‬رَبَّنَا‭ ‬آتِنَا‭ ‬فِى‭ ‬الدُّنْيَا‭ ‬حَسَنَةً‭ ‬وَفِى‭ ‬الْآخِرَةِ‭ ‬حَسَنَةً‭ ‬وَقِنَا‭ ‬عَذَابَ‭ ‬النَّارِ‭.`,
  translation_text: `Уа, Алла! Бізге Сені және Пайғамбарыңды жақсы көруді нәсіп ет. Періштелеріңді, пайғамбарларыңды, елшілерің мен ізгі құлдарыңды жақсы көруді нәсіп ет. Уа, Алла! Бізге Өз махаббатың мен сүйіктіңнің махаббатын нәсіп ет. Періштелеріңнің, пайғамбарларыңның, елшілерің мен ізгі құлдарыңның бізді жақсы көруін нәсіп ет. 
Уа, Алла! Осы зияратымды Расулыңның харамы  Мәдинаға соңғы зияратым қыла көрме! Жақсылық жасап, жомарттық етіп Харам шәріп пен Мәдина Мүнәууараға тағы да қайта келуімді нәсіп ете көр! Дүние мен ақыретте денсаулық пен береке бер. Бізді отанымызға аман-сау және қажылықтан алған нәрімізбен, берекемізбен жетуімізді нәсіп ет және жеңілдет. Әмин. Уа, Алла! Толықтай Саған берілдім. Тек Саған тәуекел еттім, Саған иман еттім, Сенің үкіміңе жүгіндім. Бұрын жасаған, ілгеріде жасайтын жасырын және ашық барлық күнәларымды кешіре көр. Сен менің Раббымсың, Сенен басқа құдай жоқ. 
Уа, Раббымыз! Бізді және бізден бұрын иман еткен барлық бауырларымызды кеше көр! Жүрегімізде иман еткендерге деген өкпе, реніш қалдырма! Шүбәсіз, Сен өте рақымды, ерекше мейірімдісің. Уа, Раббым! Бізге дүние мен ақыретте жақсылық беріп, тозақ азабынан сақтай көр!
`,
  translation_text_ru: `О Аллах! Даруй нам любовь к Тебе и Твоему пророку, к ангелам, пророкам, посланникам и праведным рабам.о Аллах! Одари нас Твоей любовью и любовью Твоего возлюбленного раба, ангелов, пророков, посланников и праведных рабов.
О Аллах, не делай это последней (моей) встречей с харамом Твоего посланника, облегчи мне возвращение к Мекке и Медине, сделай этот путь лёгким по милости Своей, даруй мне прощение и благополучие в мире этом и в мире вечном и благополучно верни нас на родину здравыми и добившимися успеха!
О Аллах! Я полностью вверился Тебе. Я уповал лишь на Тебя. Я уверовал в Тебя и руководствовался лишь Твоими повелениями. Прости мне все мои прошлые и будущие грехи. Нет бога, кроме Тебя.
Господь наш! Прости нас и наших братьев, которые уверовали раньше нас! Не насаждай в наших сердцах ненависти и зависти к тем, кто уверовал. Господь наш! Воистину, Ты — Сострадательный, Милосердный Господь мой! Одари нас добром в этом мире и добром в Последней жизни. Храни нас от мучений Ада.
`,
  translation_text_tt: `ۋا، اللا! بىزگە سەنى جانە پايعامبارىڭدى جاقسى كورۋدى ءناسىپ ەت. پەرىشتەلەرىڭدى، پايعامبارلارىڭدى، ەلشىلەرىڭ مەن ىزگى قۇلدارىڭدى جاقسى كورۋدى ءناسىپ ەت. ۋا، اللا! بىزگە ءوز ماحابباتىڭ مەن سۇيىكتىڭنىڭ ماحابباتىن ءناسىپ ەت. پەرىشتەلەرىڭنىڭ، پايعامبارلارىڭنىڭ، ەلشىلەرىڭ مەن ىزگى قۇلدارىڭنىڭ ءبىزدى جاقسى كورۋىن ءناسىپ ەت. 
ۋا، اللا! وسى زياراتىمدى راسۋلىڭنىڭ حارامى ماديناعا سوڭعى زياراتىم قىلا كورمە! جاقسىلىق جاساپ، جومارتتىق ەتىپ حارام ءشارىپ پەن ءمادينا مۇناۋۋاراعا تاعى دا قايتا كەلۋىمدى ءناسىپ ەتە كور! دۇنيە مەن اقىرەتتە دەنساۋلىق پەن بەرەكە بەر. ءبىزدى وتانىمىزعا امان-ساۋ جانە قاجىلىقتان العان نارىمىزبەن، بەرەكەمىزبەن جەتۋىمىزدى ءناسىپ ەت جانە جەڭىلدەت. ءامين. ۋا، اللا! تولىقتاي ساعان بەرىلدىم. تەك ساعان تاۋەكەل ەتتىم، ساعان يمان ەتتىم، سەنىڭ ۇكىمىڭە جۇگىندىم. بۇرىن جاساعان، ىلگەرىدە جاسايتىن جاسىرىن جانە اشىق بارلىق كۇنالارىمدى كەشىرە كور. سەن مەنىڭ راببىمسىڭ، سەنەن باسقا قۇداي جوق. 
ۋا، راببىمىز! ءبىزدى جانە بىزدەن بۇرىن يمان ەتكەن بارلىق باۋىرلارىمىزدى كەشە كور! جۇرەگىمىزدە يمان ەتكەندەرگە دەگەن وكپە، رەنىش قالدىرما! ءشۇباسىز، سەن وتە راقىمدى، ەرەكشە مەيىرىمدىسىڭ. ۋا، راببىم! بىزگە دۇنيە مەن اقىرەتتە جاقسىلىق بەرىپ، توزاق ازابىنان ساقتاي كور!
`
}
