import al_haram_enter_audio from '../../assets/al_haram_enter.mp3'
import al_haram_exit_audio from '../../assets/al_haram_exit.mp3'
import bye_kaahbah_muaz_audio from '../../assets/bye_kaahbah_muaz.mp3'
import mekkah_enter_audio from '../../assets/mekkah_enter.mp3'
import see_kaabah_muaz_audio from '../../assets/see_kaabah_muaz.mp3'
import zhannat_salem_audio from '../../assets/zhannat_salem.mp3'
import at_multazam_audio from '../../assets/at_multazam.mp3'
import hadisha_salem_audio from '../../assets/hadisha_salem.mp3'

export const hadisha_salem = {
  id: 'hadisha_salem',
  audio_url: hadisha_salem_audio,
  title: 'Хадиша анамызға сәлем беру',
  title_ru: 'Приветствие Хадидже (р.анха)',
  title_tt: `حاديشا انامىزعا سالەم بەرۋ`,
  prayer_text: `اَلسَّلَامُ‭ ‬عَلَيْكِ‭ ‬يَا‭ ‬خَدِجَةَ‭ ‬الْكُبْرَى‭ ‬رَضِىَ‭ ‬اللهُ‭ ‬عَنْهَا،
اَلسَّلَامُ‭ ‬عَلَيْكِ‭ ‬يَا‭ ‬زَوْجَةَ‭ ‬رَسُولِ‭ ‬اللهِ،
اَلسَّلَامُ‭ ‬عَلَيْكِ‭ ‬يَا‭ ‬اُمَّنَا،
اَلسَّلَامُ‭ ‬عَلَيْكِ‭ ‬يَا‭ ‬اُمَّ‭ ‬الْمُؤْمِنِينَ‭ ‬وَالْمُؤْمِنَاتِ‭.`,
  translation_text: `Сәлем саған, уа, Хадижәт ул-Кубра! 
Сәлем саған, уа, Пайғамбар жұбайы!
Сәлем саған, уа, біздің анамыз!
Сәлем саған, уа, мұсылмандардың анасы!`,
  translation_text_ru: `Мир тебе, о Хадиджату’ль-Кубра! (радияллаху анха)
Мир тебе, о супруга Посланник Аллаха!
Мир тебе, о наша Мать!
Мир тебе, о мать правоверных!`,
  translation_text_tt: `سالەم ساعان، ۋا، ءحاديجات ۋل-كۋبرا! 
سالەم ساعان، ۋا، پايعامبار جۇبايى!
سالەم ساعان، ۋا، ءبىزدىڭ انامىز!
سالەم ساعان، ۋا، مۇسىلمانداردىڭ اناسى!`
}

export const al_haram_enter = {
  id: 'al_haram_enter',
  audio_url: al_haram_enter_audio,
  title: 'ӘЛ-ХАРАМҒА КІРЕРДЕ ОҚЫЛАТЫН ДҰҒА',
  title_ru: 'Дуа, читаемая при входе мечеть Аль-Харам',
  title_tt: `ءال-حارامعا كىرەردە وقىلاتىن دۇعا`,
  prayer_text: `بِسْمِ‭ ‬اللهِ‭ ‬وَالْحَمْدُ‭ ‬لِلهِ‭ ‬وَالصَّلَاةُ‭ ‬وَ‭ ‬السَّلَامُ‭ ‬عَلَى‭ ‬رَسُولِ‭ ‬اللهِ‭. ‬اَللّٰهُمَّ‭ ‬اغْفِرْ‭ ‬لِى‭ ‬ذُنُوبِى‭ ‬وَافْتَحْ‭ ‬لِى‭ ‬اََبْوَابَ‭ ‬رَحْمَتِكَ‭. ‬نَوَيْتُ‭ ‬الْاِعْتِكَافَ‭ ‬حَتَّى‭ ‬اَخْرُجَ‭.`,
  translation_text: `Алланың атымен кіремін. Мадақ-мақтау Аллаға тән. Салауат пен сәлем Алланың пайғамбарына болсын. Уа, Алла! Күнәларымды кешіп, рахмет есіктеріңді аша көр. Осы мешіттен шыққанға дейін итиқафқа ниет еттім.`,
  translation_text_ru: `Войду во имя Аллаха, хвала присуща Аллаху, благославение и приветствие пророку Аллаха. О, Аллах! Прости все мои грехи, открой двери благодарности. До выхода этой мечети желаю провести итикафу.`,
  translation_text_tt: `اللانىڭ اتىمەن كىرەمىن. ماداق-ماقتاۋ اللاعا ءتان. سالاۋات پەن سالەم اللانىڭ پايعامبارىنا بولسىن. ۋا، اللا! كۇنالارىمدى كەشىپ، راحمەت ەسىكتەرىڭدى اشا كور. وسى مەشىتتەن شىققانعا دەيىن يتيقافقا نيەت ەتتىم.`
}
export const at_multazam = {
  id: 'at_multazam',
  audio_url: at_multazam_audio,
  title: 'Мүлтазамда оқылатын дұға',
  title_ru: 'Дуа у Мультазама',
  title_tt: `ءمۇلتازامدا وقىلاتىن دۇعا`,
  prayer_text: `اَللّٰهُمََّ‭ ‬يَا‭ ‬رَبَّ‭ ‬الْبَيْتِ‭ ‬الْعَتِيْقِ‭ ‬اََعْتِقْ‭ ‬رِقَابَنَا‭ ‬وَرِقَابَ‭ ‬آبَائِنَا‭ ‬وَاَُمَّهَاتِنَا‭ ‬وَاِخْوَانِنَا‭ ‬وَاََوْلَادِنَا‭ ‬مِنَ‭ ‬النَّارِ‭ ‬يَاذَا‭ ‬الْجُودِ‭ ‬وَالْكَرَمِ‭ ‬وَالْفَضْلِ‭ ‬وَاْلمَنِّ‭ ‬وَالْعَطَاءِ‭ ‬وَاْلاِحْسَانِ‭. ‬اَللّٰهُمَّ‭ ‬اََحْسِنْ‭ ‬عَاقِبَتَنَا‭ ‬فِى‭ ‬الْاَُمُورِ‭ ‬كُلِّهَا‭ ‬وَاََجِرْنَا‭ ‬مِنْ‭ ‬خِزْىِ‭ ‬الدُّنْيَا‭ ‬وَعَذَابِ‭ ‬اْلاخِرَةِ‭. ‬اَللّٰهُمََّ‭ ‬اِنِّى‭ ‬عَبْدُكَ‭ ‬وَابْنُ‭ ‬عَبْدِكَ‭ ‬وَاقِفٌ‭ ‬تَحْتَ‭ ‬بَابِكَ‭ ‬مُلْتَزِمٌ‭ ‬بِاََعْتَابِكَ‭ ‬مُتَذَلِّلٌ‭ ‬بَيْنَ‭ ‬يَدَيْكَ‭ ‬اََرْجُو‭ ‬رَحْمَتَكَ‭ ‬وَاََخْشَى‭ ‬عَذَابَكَ‭ ‬يَا‭ ‬قَدِيمَ‭ ‬اْلاِحْسَانِ‭. ‬اَللّٰهُمَّ‭ ‬اِنِّى‭ ‬اََسْاََلُكَ‭ ‬اََنْ‭ ‬تَرْفَعَ‭ ‬ذِكْرِى‭ ‬وَتَضَعَ‭ ‬وِزْرِى‭ ‬وَتُصْلِحَ‭ ‬اََمْرِى‭ ‬وَتُطَهِّرَ‭ ‬قَلْبِى‭ ‬وَتُنَوِّرَ‭ ‬لِى‭ ‬فِى‭ ‬قَبْرِى‭ ‬وَتَغْفِرَ‭ ‬لِى‭ ‬ذَنْبِى‭ ‬وَاََسْاََلُكَ‭ ‬الدَّرَجَاتِ‭ ‬الْعُلَى‭ ‬مِنَ‭ ‬الْجَنَّةِ‭. ‬آمِين‭.‬`,
  translation_text: `Уа, қасиетті Қағбаның иесі Алла! Уа, жомарттық пен жақсылықтың, кешірім мен игіліктің иесі Аллам! Бізді, ата-анамызды, жұбайларымызды, балаларымызды, бауырларымызды, жақындарымызды, достарымызды, халқымызды және барлық мұсылмандарды тозақ отынан сақтай көр. Бүкіл істеген ісіміздің ақырын қайырлы қыл. Осы дүниеде қор болудан сақта. Мен де Сенің бір құлыңмын және бір құлыңның перзентімін.
Уа, жақсылығы мол Алла тағалам! Міне, босағаңда телміріп, рақымыңнан үміттеніп, азабыңнан қорқып тұрған жайым бар.
Уа, Алла! Сенен абыройымды асқақтатуыңды, мойнымдағы күнәлардан арылтуыңды, ісімді оңға бастап, жүрегімді тазартуыңды, қабірімде мені нұрландыруыңды және күнәларымды кешіруіңді тілеймін. Жәннәтта биік дәрежеге жеткізуіңді тілеймін.`,
  translation_text_ru: `О Аллах, Господь Каабы! Огради нас, наших родителей, жен, детей, братьев и сестер, родственников, друзей, народ и всех мусульман от адского Огня. О Аллах! Ты обладатель всех благ, щедрости, милости, доброты и величия. Даруй нам из тех благ этой жизни и вечной,что Ты приготовил для своих рабов, приведи все наши дела к благому завершению. Огради нас от бед этой жизни и мучений вечности.
О Аллах! Я пришел к Тебе, испытывая нужду. Перед Твоим Ликом я, униженный, презренный, прошу Тебя о прощении и милости, страшась Твоего наказания. О Аллах, обладатель безграничной щедрости! Даруй нам блага этого мира и вечного, не отвергай наши просьбы. О Аллах! Я прошу Тебя принять мои мольбы, снять с меня груз грехов, поправить мои дела, очистить мое сердце, озарить светом мою душу, простить мои ошибки и даровать мне удел в Раю.`,
  translation_text_tt: `ۋا، قاسيەتتى قاعبانىڭ يەسى اللا! ۋا، جومارتتىق پەن جاقسىلىقتىڭ، كەشىرىم مەن يگىلىكتىڭ يەسى اللام! ءبىزدى، اتا-انامىزدى، جۇبايلارىمىزدى، بالالارىمىزدى، باۋىرلارىمىزدى، جاقىندارىمىزدى، دوستارىمىزدى، حالقىمىزدى جانە بارلىق مۇسىلمانداردى توزاق وتىنان ساقتاي كور. بۇكىل ىستەگەن ءىسىمىزدىڭ اقىرىن قايىرلى قىل. وسى دۇنيەدە قور بولۋدان ساقتا. مەن دە سەنىڭ ءبىر قۇلىڭمىن جانە ءبىر قۇلىڭنىڭ پەرزەنتىمىن.
ۋا، جاقسىلىعى مول اللا تاعالام! مىنە، بوساعاڭدا تەلمىرىپ، راقىمىڭنان ۇمىتتەنىپ، ازابىڭنان قورقىپ تۇرعان جايىم بار.
ۋا، اللا! سەنەن ابىرويىمدى اسقاقتاتۋىڭدى، موينىمداعى كۇنالاردان ارىلتۋىڭدى، ءىسىمدى وڭعا باستاپ، جۇرەگىمدى تازارتۋىڭدى، قابىرىمدە مەنى نۇرلاندىرۋىڭدى جانە كۇنالارىمدى كەشىرۋىڭدى تىلەيمىن. ءجانناتتا بيىك دارەجەگە جەتكىزۋىڭدى تىلەيمىن.`
}
export const al_haram_exit = {
  id: 'al_haram_exit',
  audio_url: al_haram_exit_audio,
  title: 'Әл-Харамнан шығарда оқылатын дұға',
  title_ru: 'Дуа читаемая при выходе из мечети аль-Харам',
  title_tt: `ءال-حارامنان شىعاردا وقىلاتىن دۇعا`,
  prayer_text: `بِسْمِ‭ ‬اللهِ‭ ‬وَالْحَمْدُ‭ ‬لِلهِ‭ ‬وَالصَّلَاةُ‭ ‬وَ‭ ‬السَّلَامُ‭ ‬عَلَى‭ ‬رَسُولِ‭ ‬اللهِ‭. ‬اَللّٰهُمَّ‭ ‬اِنِّى‭ ‬اَسْئَلُكَ‭ ‬مِنْ‭ ‬فَضْلِكَ،‭ ‬اَللّٰهُمَّ‭ ‬اَعْصِمْنِى‭ ‬مِنَ‭ ‬الشَّيْطَانِ‭ ‬الرَّجِيمِ‭.`,
  translation_text: `Алланың атымен шығамын. Мадақ-мақтау Аллаға тән. Салауат пен сәлем Алланың пайғамбарына болсын. Уа, Алла! Маған мол қазынаңнан бере көр. Мені қуылған шайтанның кесірінен сақта. `,
  translation_text_ru: `Выйду во имя Аллаха, хвала присуща Аллаху, благославение и приветствие пророку Аллаха. О, Аллах! Спаси меня от изгнанного шайтана.`,
  translation_text_tt: `اللانىڭ اتىمەن شىعامىن. ماداق-ماقتاۋ اللاعا ءتان. سالاۋات پەن سالەم اللانىڭ پايعامبارىنا بولسىن. ۋا، اللا! ماعان مول قازىناڭنان بەرە كور. مەنى قۋىلعان شايتاننىڭ كەسىرىنەن ساقتا. `
}
export const bye_kaahbah_muaz = {
  id: 'bye_kaahbah_muaz',
  audio_url: bye_kaahbah_muaz_audio,
  title: 'Қағба муаззамамен қоштасарда оқылатын дұға',
  title_ru: 'Дуа при прощании с Каабой',
  title_tt: `قاعبا مۋاززامامەن قوشتاساردا وقىلاتىن دۇعا`,
  prayer_text: `اَللّٰهُمَّ‭ ‬لَا‭ ‬تَجْعَلْهُ‭ ‬آخِرَ‭ ‬الْعَهْدِ‮ ‬مِنْ‭ ‬بَيْتِكَ‭ ‬الْحَرَامِ‭ ‬وَاِنْ‭ ‬جَعَلْتَهُ‭ ‬فَعَوِّضْنِى‭ ‬عَنْهُ‭ ‬الْجَنَّةَ‭ ‬يَا‭ ‬اَرْحَمَ‭ ‬الرَّاحِمِينَ‭. ‬آئِبُونَ‭ ‬عَابِدونَ‭ ‬لِرَبِّنَا‭ ‬حَامِدُونَ‭ ‬وَلِرَحْمَتِهِ‭ ‬قَاصِدُونَ‭.‬صَدَقَ‭ ‬اللهُ‭ ‬وَعْدَهُ‭ ‬وَنَصَرَ‭ ‬عَبْدَهُ‭ ‬وَهَزَمَ‭ ‬الْاََحْزَابَ‭ ‬وَحْدَهُ‭ ‬وَلَا‭ ‬حَوْلَ‭ ‬وَلَا‭ ‬قُوَّةَ‭ ‬اِلَّا‭ ‬بِاللهِ‭ ‬الْعَلِيِّ‭ ‬الْعَظِيمِ‭.‬`,
  translation_text: `Уа, Алла! Қасиетті үйіңе (Қағбаға) тағы келуімді нәсіп еткейсің. Егер бұл соңғы зияратым болса, жұмағыңды нәсіп еткейсің. Уа, мейірімділердің ең мейірімдісі! 
Уа, Алла! Сенің құлың болып қайтып барамыз, Раббымызға мадақ айтып, Оның мейірімін күтеміз. Алла сөзіне берік, құлына қамқор, дұшпандарын бір Өзі жеңуші. Барлық күш-құдірет ұлы, үстем Аллаға тән. `,
  translation_text_ru: `О Аллах! Не делай это мое посещение Запретного Дома последним. Если же оно последнее, то даруй мне в награду Рай, о Самый Милосердный. Господь мой, мы возвращаемся, будучи Твоими рабами, мы восхваляем лишь нашего Господа и надеемся на Его милость.  Вся сила принадлежит великому Аллаху.`,
  translation_text_tt: `ۋا، اللا! قاسيەتتى ۇيىڭە (قاعباعا) تاعى كەلۋىمدى ءناسىپ ەتكەيسىڭ. ەگەر بۇل سوڭعى زياراتىم بولسا، جۇماعىڭدى ءناسىپ ەتكەيسىڭ. ۋا، مەيىرىمدىلەردىڭ ەڭ مەيىرىمدىسى! 
ۋا، اللا! سەنىڭ قۇلىڭ بولىپ قايتىپ بارامىز، راببىمىزعا ماداق ايتىپ، ونىڭ مەيىرىمىن كۇتەمىز. اللا سوزىنە بەرىك، قۇلىنا قامقور، دۇشپاندارىن ءبىر ءوزى جەڭۋشى. بارلىق كۇش-قۇدىرەت ۇلى، ۇستەم اللاعا ءتان.`
}
export const mekkah_enter = {
  id: 'mekkah_enter',
  audio_url: mekkah_enter_audio,
  title: 'МЕККЕ МҮКӘРРАМАҒА КІРЕРДЕ ОҚЫЛАТЫН ДҰҒА',
  title_ru: 'Дуа, читаемая при входе в Мекку мукаррама',
  title_tt: `مەككە مۇكارراماعا كىرەردە وقىلاتىن دۇعا`,
  prayer_text: `اَللّٰهُمَّ‭ ‬هٰذَا‭ ‬حَرَمُكَ‭  ‬وَ‭ ‬مَأْمَنُكَ‭ ‬قُلْتُ‭ ‬وَقَوْلُكَ‭ ‬الْحَقُّ‭ ‬وَ‭ ‬مَنْ‭ ‬دَخَلَهُ‭ ‬كَانَ‭ ‬آمِنًا‭. ‬اَللّٰهُمَّ‭ ‬فَحَرِّمْ‭ ‬لَحْمِى‭ ‬وَ‭ ‬دَمِى‭ ‬عَلَى‭ ‬النَّارِ‭ ‬وَ‭ ‬قِنِى‭ ‬عَذَابَكَ‭ ‬يَوْمَ‭ ‬تُبْعَثُ‭ ‬عِبَادُكَ‭.`,
  translation_text: `Уа, Алла! Бұл жер Сенің қорғалған харам аймағың, сенімді жерің. Сенің: “Бұл жерге кірген амандықта болады” деген сөзің хақ. Уа, Алла! Денемді тозақ отынан сақта. Өлгеннен соң қайта тірілетін қиямет күні мені азабыңнан сақтай көр.`,
  translation_text_ru: `О, Аллах! Это место – Твое защищенное надежное место. Этому свидетельствует Твое слово: «Тот кто войдет в это место, будет здоровым». О, Аллах. Защити мое тело от огня Ада. Защити от боли, в судный день.`,
  translation_text_tt: `ۋا، اللا! بۇل جەر سەنىڭ قورعالعان حارام ايماعىڭ، سەنىمدى جەرىڭ. سەنىڭ: “بۇل جەرگە كىرگەن اماندىقتا بولادى” دەگەن ءسوزىڭ حاق. ۋا، اللا! دەنەمدى توزاق وتىنان ساقتا. ولگەننەن سوڭ قايتا تىرىلەتىن قيامەت كۇنى مەنى ازابىڭنان ساقتاي كور.`
}
export const see_kaabah_muaz = {
  id: 'see_kaabah_muaz',
  audio_url: see_kaabah_muaz_audio,
  title: 'Қағба муаззаманы көргенде оқылатын дұға',
  title_ru: 'Дуа читаемая при взгляде на Кааба муаззаму',
  title_tt: `قاعبا مۋاززامانى كورگەندە وقىلاتىن دۇعا`,
  prayer_text: `اَللهُ‭ ‬اََكْبَرُ‭ ‬اَللهُ‭ ‬اََكْبَرُ‭ ‬لَا‭ ‬اِلٰهَ‭ ‬اِلَّا‭ ‬اللهُ‭ ‬وَاللهُ‭ ‬اََكْبَرُ‭. ‬اَللهُ‭ ‬اََكْبَرُ‭ ‬وَلِلهِ‭ ‬الْحَمْدُ‭. ‬اَللّٰهُمَّ‭ ‬اََنْتَ‭ ‬السَّلَامُ‭ ‬وَمِنْكَ‭ ‬السَّلَامُ‭ ‬وَ‭ ‬اِلَيْكَ‭ ‬يَرْجِعُ‭ ‬السَّلَامُ‭ ‬حَيِّنَا‭ ‬رَبَّنَا‭ ‬بِالسَّلَامِ‭ ‬اَدْخِلْنَا‭ ‬دَارَ‭ ‬السَّلَامِ‭ ‬تَبَارَكْتَ‭ ‬رَبَّنَا‭  ‬وَتَعَالَيْتَ‭ ‬يَا‭ ‬ذَاالْجَلَالِ‭ ‬وَ‭ ‬الْاِكْرَامِ‭. ‬اَللّٰهُمَّ‭ ‬زِدْ‭ ‬هٰذَا‭ ‬البَيْتَ‭ ‬تَشْرِيفًا‭ ‬وَ‭ ‬تَعْظِيمًا‭ ‬وَ‭ ‬تَكْرِيمًا‭ ‬وَ‭ ‬مَهَابَةً‭ ‬وَ‭ ‬زِدْ‭ ‬مَنْ‭ ‬شَرَّفَهُ‭ ‬وكَرَّمَهُ‭ ‬مِمَّنْ‭ ‬حَجَّهُ‭ ‬اََوِ‭ ‬اعْتَمَرَهُ‭ ‬تَشْرِيفًا‭ ‬وَ‭ ‬تَكْرِيمًا‭ ‬وَ‭ ‬تَعْظِيمًا‭ ‬وَ‭ ‬بِرًّا‭.`,
  translation_text: `Алла ұлы, Алла ұлы, Алладан басқа құдай жоқ. Алла ұлы, Алла ұлы, Барлық мадақ Аллаға тән. 
Алла тағалам! Сәләм - Сенсің! Амандық пен саламаттық тек Сенде. Уа, Раббымыз, бізге тыныштықта өмір сүруімізге нәсіп ете көр. Тыныштық пен бейбітшілік отауы жәннәтыңа кіруімізді нәсіп ет.  Ұлылық пен құрметке лайық Алла тағалам. Сен барлық нәрседен ұлысың әрі жоғарысың.  
Уа, Алла! Осы үйдің, абыройын, салтанатын, сәні мен айбатын арттыр. Қажылық және ұмра жасаушылардың да абыройын асқақтатып, жақсылығын көбейт. `,
  translation_text_ru: `Аллах велик. Аллах велик. Нет Бога кроме Аллаха. Аллах велик. Хвала Аллаху. О, Господи! Приветствие - Тебе. Благополучие только в Тебе, О, Аллах! Чтобы мы могли жить в мире. Во имя мира прославляй наш вход в рай, глубокое величие и уважение к Тебе. О, Аллах! Ты велик и выше от всего. О, Аллах! Повысь честь, величие, роскошь этого дома. Умножай добром совершающих Хадж и Умра.`,
  translation_text_tt: `اللا ۇلى، اللا ۇلى، اللادان باسقا قۇداي جوق. اللا ۇلى، اللا ۇلى، بارلىق ماداق اللاعا ءتان. 
اللا تاعالام! ءسالام - سەنسىڭ! اماندىق پەن سالاماتتىق تەك سەندە. ۋا، راببىمىز، بىزگە تىنىشتىقتا ءومىر سۇرۋىمىزگە ءناسىپ ەتە كور. تىنىشتىق پەن بەيبىتشىلىك وتاۋى ءجانناتىڭا كىرۋىمىزدى ءناسىپ ەت. ۇلىلىق پەن قۇرمەتكە لايىق اللا تاعالام. سەن بارلىق نارسەدەن ۇلىسىڭ ءارى جوعارىسىڭ. 
ۋا، اللا! وسى ءۇيدىڭ، ابىرويىن، سالتاناتىن، ءسانى مەن ايباتىن ارتتىر. قاجىلىق جانە ۇمرا جاساۋشىلاردىڭ دا ابىرويىن اسقاقتاتىپ، جاقسىلىعىن كوبەيت.`
}
export const zhannat_salem = {
  id: 'zhannat_salem',
  audio_url: zhannat_salem_audio,
  title: 'Жәннәт ул-мұғаллаға сәлем беру',
  title_ru: 'Приветствие Джаннат уль-Муалля',
  title_tt: `ءجاننات ۋل-مۇعاللاعا سالەم بەرۋ`,
  prayer_text: `اَلسَّلَامُ‭ ‬عَلَيْكُمْ‭ ‬يَا‭ ‬اَهْلَ‭ ‬بَيْتِ‭ ‬رَسُولِ‭ ‬اللهِ،
اَلسَّلَامُ‭ ‬عَلَيْكُمْ‭ ‬يَا‭ ‬اَصْحَابَ‭ ‬النَّبِىِّ،
اَلسَّلَامُ‭ ‬عَلَيْكُمْ‭ ‬يَا‭ ‬اَهْلَ‭ ‬جَنَّةِ‭ ‬الْمُعَلَّا،
اَلسَّلَامُ‭ ‬عَلَيْكُمْ‭ ‬يَا‭ ‬اَوْلِيَاءَ‭ ‬اللهِ،
اَلسَّلَامُ‭ ‬عَلَيْكُمْ‭ ‬يَا‭ ‬عُلَمَاءَ‭ ‬اللهِ،
اَلسَّلَامُ‭ ‬عَلَيْكُمْ‭ ‬يَا‭ ‬شُهَدَاءَ‭ ‬اللهِ،
اَلسَّلَامُ‭ ‬عَلَيْكُمْ‭ ‬يَا‭ ‬دَارَ‭ ‬قَوْمٍ‭ ‬مُؤْمِنِينَ،‭ ‬وَاِنَّا‭ ‬اِنْ‭ ‬شَاءَ‭ ‬اللهُ‭ ‬بِكُمْ‭ ‬لاحِقُونَ‭. ‬نَسْاََلُ‭ ‬اللهَ‭ ‬لَنَا‭ ‬وَلَكُمُ‭ ‬العافِيَةَ‭.`,
  translation_text: `Сәлем сендерге, уа, Пайғамбардың жанұясы,
Сәлем сендерге, уа, Пайғамбардың сахабалары,
Сәлем сендерге, уа, жәннат ул-муғалла тұрғындары,
Сәлем сендерге, уа, Алла достары,
Сәлем сендерге, уа, Алланың ғалымдары,
Сәлем сендерге, уа, Алланың шейттері,
Сәлем сендерге, уа, мұсылмандар елі. Біз де, Алла қаласа, қастарыңа келеміз. Өзімізге және сіздерге Алладан амандық сұраймыз. `,
  translation_text_ru: `Мир вам, о семейство Посланника Аллаха,
Мир вам, о сахабы Посланника Аллаха,
Мир вам, о покоящиеся на кладбище Джаннату’ль-муалля,
Мир вам, о друзья Аллаха,
Мир вам, о алимы Аллаха,
Мир вам, о погибшие на пути Аллаха,
Мир вам, о верующие,
Если пожелает Аллах, мы последуем за вами. Да простит Аллах вас и нас.`,
  translation_text_tt: `سالەم سەندەرگە، ۋا، پايعامباردىڭ جانۇياسى،
سالەم سەندەرگە، ۋا، پايعامباردىڭ ساحابالارى،
سالەم سەندەرگە، ۋا، ءجاننات ۋل-مۋعاللا تۇرعىندارى،
سالەم سەندەرگە، ۋا، اللا دوستارى،
سالەم سەندەرگە، ۋا، اللانىڭ عالىمدارى،
سالەم سەندەرگە، ۋا، اللانىڭ شەيتتەرى،
سالەم سەندەرگە، ۋا، مۇسىلماندار ەلى. ءبىز دە، اللا قالاسا، قاستارىڭا كەلەمىز. وزىمىزگە جانە سىزدەرگە اللادان اماندىق سۇرايمىز.`
}
